[{"country":"United States","city":"Chesapeake","description":"The Branch Manager is responsible for the overall administration and efficient daily operation of a full service branch office, including operations, team development, opening accounts, lending, customer service, and security and safety in accordance with the Bank's objectives.\n  \n\n  \nQualifications:\n  \n•Demonstrated ability to deliver outstanding customer service.\n  \n•Proficient computer skills, math aptitude and attention to detail is a must.\n  \n•Demonstrated strong leadership skills and dependability.\n  \n•Effectively communicate and demonstrate strong time management skills as required.\n  \n•Able to work well under pressure and be able to meet deadlines\n  \n•Minimum three years solid management experience in a retail environment is required, including managing a staff, coaching, and meeting goals. Banking environment desirable.\n  \n•Excellent demonstrable time management, communication and motivational skills are necessary.\n  \n•Bachelor’s degree required or commensurate experience.\n  \n•Must be willing to work a flexible schedule, including some evenings and Saturdays.\n  \n•A valid driver’s license and access to a reliable vehicle is required.\n  \n\n  \nPrinciple Activities and Duties:\n  \n•Consistently provide quality service as outlined in the Bank’s Quality Service Statement.\n  \n•Directly impact the growth and retention of customers through proactive efforts.  This can be accomplished by managing Online RB, ensuring their team is offering customers additional products and services, and holding regular monthly call nights to follow-up on any lists created by the Marketing Department, as well as, other sources of referrals from inside the branch.\n  \n•Focus on building a customer service driven team where everyone contributes to the success of the Relationship Building and Operational efforts.\n  \n•Develop and motivate the team members of their Office by offering constructive feedback and positive reinforcement. This can be accomplished at regular team meetings and through individual documented coaching sessions. Continue the development of the Operation and Relationship Manager’s leadership skills by offering constructive feedback and positive reinforcement through individual documented coaching sessions.\n  \n•Represent Dollar Bank in the community in a professional and competent manner at all times. Is expected to source business deposit and loan relationships within the surrounding communities through active participation in various organizations and charitable functions.\n  \n•Meet the established Group Banking Onsite Visit and Checking Accounts Opened goals each month. This will be accomplished by being proactive in outside calling efforts and by taking advantage all Group Banking opportunities within his market.\n  \n•Exhibit operational knowledge while upholding the operational integrity of the office by assisting the team in all areas of branch operations including Compliance.\n  \n•Achieve all Relationship Building, Operational Integrity, and Customer Service goals.\n  \n•Exercise sound decision-making skills as it relates to balancing risk, profitability, and customer service with every decision.\n  \n•Consistently lead by example, maintain professionalism and a positive attitude at all times and exercise superior leadership skills.\n  \n\n  \n**Address:**  1580 Crossways Blvd\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Rotating Schedule\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollarbank.com\/careers\/training_and_benefits.aspx .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Branch Manager","url":"http:\/\/dollarbankcareers.jobs\/11C5F7E114DD4D7BB25E0A6EA6E36DB624","date_new":"2018-06-24 03:40:16","reqid":"2315BR","country_short":"USA","uid":null,"guid":"11C5F7E114DD4D7BB25E0A6EA6E36DB6","company":"Dollar Bank FSB","location":"Chesapeake, VA","state":"Virginia","state_short":"VA"},{"country":"United States","city":"Pittsburgh","description":"JOB FUNCTION \/ PURPOSE:\n  \n\n  \nDigital is a rapidly growing and critical area at Dollar Bank.  The VP of Digital Product Management will be responsible for helping to plan, create, and execute the digital strategy across the bank’s lines of business.  This person will create and manage the roadmaps for all digital platforms (mobile & online) and lead all components of the product life cycle for digital platforms, services, and features.  Responsibilities also include working with the marketing, technology, customer service, legal, accounting, risk, and other areas of the bank to ensure clear communications and timely issue resolution to deliver continual improvement for our digital efforts.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \n• Bachelor’s degree in Business, Management, Technology, or a related discipline required;\n  \n• 8-10+ years of product management experience in the digital\/mobile space including developing and delivering on digital\/mobile strategy initiatives.\n  \n• Demonstrated experience in an online product management role driving the development and implementation of online strategies.\n  \n• Proven ability to develop product roadmaps, define requirements and lead implementation efforts successfully.\n  \n• Demonstrated experience guiding online\/mobile user design experiences.\n  \n• Demonstrated experience managing complex projects.\n  \n• Superior quantitative and analytical skills, critical thinking, and ability to synthesize data and draw conclusions.\n  \n• Demonstrated communications, interpersonal, and relationship management skills; ability to work well as part of a cross-functional team and lead across the organization at multiple levels.\n  \n• Ability to influence diverse, cross functional team to success without direct authority over the team.\n  \n• Excellent verbal, writing and presentation skills.\n  \n• Passion for customers and a demonstrated focus on customer experience.\n  \n• Personal computer skills – particularly Microsoft Office programs – and the demonstrated ability to quickly learn new software\/systems.\n  \n• Strong thought leadership required to manage the development and growth of products.\n  \n\n  \nPRINCIPAL ACTIVITIES \/ OBJECTIVES:\n  \n\n  \n• Manage overall customer experience for the digital products and services assigned and provide strategic direction and drive enhancements via 1-3 yr roadmaps.\n  \n• Develop strategic roadmap based on in-depth understanding of (1) voice of the customer; (2) competitive analysis; (3) profitability; (4) product life cycle; and (5) vendor\/platform capabilities.\n  \n• Partner with retail and business banking teams to create and use digital assets to help the businesses achieve their objectives.\n  \n• Work with project managers to oversee a portfolio of projects to provide for the digital needs of customers and prospective customers.\n  \n• Develop and manage annual Key Performance Indicators for assigned digital products and provide monthly digital scorecard and analysis that tracks results monthly for adoption and growth.\n  \n• Partner with Marketing for adoption & acquisition support, product positioning, promotion of digital products and services and onboarding activities.\n  \n• Act as the SME to understand all aspects of the internal and external environment including customer met\/unmet digital needs through research efforts, in-depth understanding of voice of the customer, industry trends, vendor\/platform capabilities and best practices for servicing the digital needs of our customers.\n  \n• Continuously assess & report on competitive moves and monitor digital platform performance against objectives.\n  \n• Develop business cases and perform cost\/benefit analysis as needed to secure funding for enhancements and initiatives.\n  \n• Present data, strategies and recommendations to senior management to build buy-in to strategic recommendations including new services, updates to existing services, and retiring existing services.\n  \n• Prioritize product requirements and coordinate release plans with IT and key constituents.\n  \n• Act as the Chair person for the cross functional Internet Committee.\n  \n• Serve as primary business point of contact & decision maker for implementation activities and work closely across key constituents to meet scheduled milestones.\n  \n• Document high level descriptions and detailed business requirements to enable resource estimates from technology and QA teams.\n  \n**Address:**  Three Gateway Center\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8AM-4:15PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"VP, Digital Product Management","url":"http:\/\/dollarbankcareers.jobs\/40B86142AA374EFDA5F8D73D81BDDA8524","date_new":"2018-06-23 04:24:38","reqid":"2311BR","country_short":"USA","uid":null,"guid":"40B86142AA374EFDA5F8D73D81BDDA85","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Pittsburgh","description":"The Customer Service Center Representative (Sales) is responsible for the sales of Dollar Bank’s products and services to meet customer expectations and departmental objectives. Candidate must be able to work a rotating schedule.  The hours for the Sales department are Monday through Friday, 8:00 am – 8:00 pm..\n  \n\n  \nDescription of Duties:\n  \n•Maintain a solid understanding of Dollar Bank retail products and services.\n  \n•Engage in proactive conversations with customers and prospects in the Pittsburgh and Cleveland market areas to gain insight and knowledge regarding their banking needs.\n  \n•Sell and open various types of retail deposit and asset accounts (checking, savings, loans and CD’s).\n  \n•Utilize professional customer service techniques when servicing customers and when resolving customer concerns.  Act as a liaison to other departments in solving customer concerns.\n  \n•Participate in ongoing customer service and sales training.\n  \n•Adhere to Bank and departmental regulations, policies and procedures in performing daily assignments and tasks.\n  \n•Other duties as assigned.\n  \n\n  \nQualifications:\n  \n•At least six months of customer service or sales experience required.\n  \n•High School Diploma\/GED required.  College degree in business related field preferred.\n  \n•Financial institution and\/or call center experience a plus.\n  \n•Excellent verbal and written communication skills.\n  \n•Ability to assess customer needs and respond to them accordingly.\n  \n•Ability to diplomatically handle difficult customer situations and respond to them accordingly.\n  \n•Ability to learn Dollar Bank retail products\/ services, regulations, policies and procedures.\n  \n•Excellent computer, internet and technical skills.\n  \n•Ability to work independently as well as part of a team.\n  \n•Ability to adapt to a changing work environment.\n  \n•Excellent organizational and time management skills.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  This position requires a rotating schedule including evenings.  The department is open Monday through Friday, 8:00 am – 8:00 pm.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Call Center Representative (Sales)","url":"http:\/\/dollarbankcareers.jobs\/D18822921EBE4E1E8C768885432650FD24","date_new":"2018-06-21 03:50:11","reqid":"2302BR","country_short":"USA","uid":null,"guid":"D18822921EBE4E1E8C768885432650FD","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Rocky River","description":"Dollar Bank, a solid and progressive financial institution since 1855 continues to expand our business and is currently seeking a Customer Service Specialist for its Westgate branch.\n  \n\n  \nJOB FUNCTION \/ PURPOSE:\n  \n\n  \nAs a Customer Service Specialist, you will be responsible for identifying our customers’ financial needs by providing a thorough analysis and recommending the most appropriate Dollar Bank products and services to fulfill those needs. You will use your customer service experience, product knowledge and positive demeanor to initiate, expand and retain customer relationships through customer conversations and outbound calling. We are looking for flexible, enthusiastic, hardworking individuals with a sincere appreciation for people and an empathetic communication style to proactively contribute to the branch sales and service goals.\n  \n\n  \nPRINCIPAL ACTIVITIES \/ OBJECTIVES:\n  \n\n  \nIn a typical banking day you will enjoy a high level of customer contact. The primary focus of this role includes:\n  \n•Providing quality customer service in a positive, courteous and enthusiastic manner to all internal and external customers\n  \n•Contributing to the growth and retention of deposit and loan customers. Demonstrating a proactive sales approach to building customer relationships, effectively utilizing the customer conversations to promote Dollar Bank products and services and meeting the established Relationship Building goals set by your management team.\n  \n•Performing teller functions based upon the needs of the branch. Maintaining an acceptable balancing record while processing transactions in an accurate and efficient manner.\n  \n•Adhering to all established branch operational processes and procedures.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \nThe successful candidate will have the following qualifications:\n  \n\n  \n•High school diploma\/GED required.\n  \n•College degree required, or a minimum of 1 year demonstrated ability to deliver outstanding customer service in financial services or retail industry.\n  \n•Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n•Ability to work a flexible schedule including evenings and Saturdays.\n  \n•Ability to travel as needed to training.\n  \n•Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \n**Address:**  20680 Center Ridge Road\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  Monday-Thursday: 8:30am - 5:30pm\n  \nFriday: 8:30am - 7:30pm\n  \nSaturday: 8:30 am - 2:30 pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Customer Service Specialist, Westgate","url":"http:\/\/dollarbankcareers.jobs\/083F8C3D08BD4C3D8C3CCC7D9C48246F24","date_new":"2018-06-21 03:50:08","reqid":"2303BR","country_short":"USA","uid":null,"guid":"083F8C3D08BD4C3D8C3CCC7D9C48246F","company":"Dollar Bank FSB","location":"Rocky River, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Pittsburgh","description":"Job Overview:\n  \n\n  \nResponsible for implementing Configuration and Test Data Processes and Tools while maintaining Compliance with Internal and External Regulators.\n  \n\n  \nQualifications:\n  \n\n  \n• Minimum 10 years I\/T related Management Experience required.\n  \n• Bachelor’s Degree in an I\/T related field.  Master’s Degree a plus. Will consider commensurate experience.\n  \n• Prior experience managing multiple simultaneous projects as well as resources with diverse I\/T backgrounds such as Quality Analysts, DBA’s, Developers, Configuration Managers and Infrastructure Support Analysts.\n  \n• Prior Leadership or Management role in at least 1 Merger and Acquisition Project.\n  \n• Information Technology Information Library (ITIL) v3 certification with a strong focus on the following ITIL frameworks:  Configuration Management System, Service Testing & Validation, Release & Deployment Management.\n  \n• SCRUM Master Certification\n  \n• Must be able to negotiate deliverables, staffing, and deadlines to meet or exceed expectations with quality product while keeping individuals abreast of current developments\n  \n• Demonstrated ability to communicate and influence effectively with all levels of the organization including C Level\n  \n• Strong Test Environment Management and Enterprise Monitoring Skills as well as Test Data Automation\n  \n• Thorough understanding of Regulatory Requirements such as SOX compliance and Experience working with Internal and External Auditors\n  \n• Prior experience Managing projects involving multiple teams as well as 3rd party vendors.\n  \n• Analytical and intuitive thinker with an exceptional attitude\n  \n• Ability to work both independently and within a team environment with tight deadlines and changing priorities\n  \n• Strong experience in formal Root Cause Analysis for Production Incidents and issues related to Configuration and Data Management\n  \n• Excellent communicator with proactive approach\n  \n• Flexibility and ability to adapt to change and cultural realities\n  \n• Advanced understanding of workflow management \/ configuration management processes and tools and able to develop and implement workflows related to Quality Management.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Have Cross Functional Matrixed Management responsibilities for resources with varying disciplines including Distributed and Mainframe Developers, Quality Analyst, DBA’s and Consultants.\n  \n• Maintain ongoing Compliance including the discovery and elimination of PII in lower environments\n  \n• Ensure all Test Environment data is De-Identified and implement manual and automated data refresh processes that allows for adequate defect discovery with on-demand synthetic data generation for data specific test scenarios.\n  \n• Develop TDM processes specifically to address Bank Conversions including compensating controls related to situations in which PII is required for Testing\n  \n• Implement Integration Service Virtualization eliminating the need and expense for 3rd party test environment integration\n  \n• Identify environment deficiencies and align technical infrastructure with production - Identify and address “We can’t test that” situations\n  \n• Manage lower environment release and deployment activities with PMO, QM, DD&I, SD&I, Infrastructure, and Telecom to align with production releases - Ensure adequate test environments to support simultaneous development of maintenance, production emergency fixes and major releases for critical client facing applications\n  \n• Coordinate activities to automate the setup and configuration of test environments\n  \n• Track releases, upgrades and changes to the test environments and perform periodic audits\n  \n• Develop KPIs to track efficiency of test environment services as well as change \/ configuration audits\n  \n• Implement Environment Monitoring \/ Logging and coordinate and resolve all environment related defects\n  \n• Provide ongoing support for all test environments\n  \n• Creates and Implements DevOps Strategies to unify software development, software operations and testing.  Implements the automation and monitoring at all steps of software construction, from integration, testing, releasing to deployment and infrastructure management\n  \n• Maintain Code and Configuration Management Compliance with FFIEC guidelines and best practices\n  \n• Responsible for software build and release strategy and the development of Configuration Management Plans\n  \n• Creates branching, merging, versioning and release strategies\n  \n• Define and implement automated build \/ deployment standards and maintain schedules\n  \n• Reduce costs associated with current source code management tools by implementing alternative industry standard tool sets\n  \n• Implement configuration management strategies which include Today’s practice of DevOps allowing for continuous design, development, testing and deployment as well as aligning with Agile development\n  \n• Performs periodic Configuration Management Audits and ensures compliance\n  \n• Implements a formal Root Cause Analysis process for Production Incidents as well as issues related to Configuration and Data Management\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8:15AM-4:30PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"VP, Configuration\/Test Environment Manager","url":"http:\/\/dollarbankcareers.jobs\/412344C1E8BB42FA848790C61F78C62224","date_new":"2018-06-20 03:35:36","reqid":"2300BR","country_short":"USA","uid":null,"guid":"412344C1E8BB42FA848790C61F78C622","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Pittsburgh","description":"JOB FUNCTION \/ PURPOSE:\n  \n\n  \nThe Staff auditor performs assigned tasks and prepares supporting schedules and work papers as part of an audit team when examining and evaluating the adequacy and effectiveness of the system of controls.  The information gathered by the auditors and their findings are communicated to management in a timely and reliable manner to assist management in evaluating and furthering the quality and efficiency of its operations.\n  \n\n  \nPRINCIPAL ACTIVITIES \/ OBJECTIVES:\n  \n\n  \n•Assists and\/or conducts audits of assigned departments and\/or branch offices to evaluate the adequacy, effectiveness and efficiency of the internal control system, and to determine compliance with established bank policies, procedures, government regulations and industry best practices.\n  \n•Performs audit program steps for assigned audits under the direction of an in-charge auditor.\n  \n•Determines compliance with policies and procedures.\n  \n•Documents an understanding of policies, procedures and the internal control system.\n  \n•Documents audit testing in a concise manner through preparation of detailed audit work papers prepared in accordance with departmental standards.\n  \n•Provides clear explanations of audit procedures performed in audit work papers.\n  \n•Prepares conclusions on the system on internal control based upon the results of the work performed.\n  \n•Presents any irregularities to in-charge auditor along with the proposed disposition.\n  \n•Documents exceptions to bank policies and procedures and internal control weaknesses.\n  \n•Assists external auditors with their annual review.\n  \n•Performs special projects and assignments under direction of department management.\n  \n•Evaluates procedures while completing the audit to determine the existence of any possible recommendations for improved efficiency.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \n•B.A. or B.S. in Accounting or business related degree required.  Audit experience strongly preferred.\n  \n•Proficiency in applying internal auditing standards, procedures and techniques while performing internal audits.\n  \n•Proficiency in accounting principals and techniques is required of auditors who work with the bank’s financial records and reports.\n  \n•An understanding of internal control principles is required to be able to recognize and evaluate deviations during the course of an audit.\n  \n•An understanding of computer concepts and controls is required.\n  \n•Proficiency in the use of a computer (MS Word, Excel).\n  \n•Good writing skills in order to prepare well-documented work papers and draft audit exception items as a basis for the formal audit report to management.\n  \n•Ability to effectively communicate both orally and in writing with customers and bank employees.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8:15AM-4:30PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Staff Auditor","url":"http:\/\/dollarbankcareers.jobs\/CBF804781E354255B489CB7D7C87F13724","date_new":"2018-06-19 03:58:40","reqid":"2288BR","country_short":"USA","uid":null,"guid":"CBF804781E354255B489CB7D7C87F137","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Pittsburgh","description":"Job Overview:\n  \n\n  \nThis position would be primarily responsible for Noninterest Income management reporting and analysis for Dollar Bank and your job duties.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Prepare a comprehensive monthly Noninterest Income reporting package for senior management.  Report includes financial schedules and commentary as well as key drivers and volume analysis detail.\n  \n• Track drivers and trends of Noninterest income products including Overdraft, ATM, Debit Card, Credit Card, Deposits, and Treasury Management.\n  \n• Participate in month-end close process.  Ensure financial results are accurate and prepare accruals as necessary.\n  \n• Review and document monthly variances to forecast and budget.  Interact with various areas of Dollar Bank, including Accounting, Product management, and business units to research material variances as needed.\n  \n• Create and enhance existing forecast modeling for Fee products using a driver based approach.\n  \n• Develop annual fee budgets and monthly forecasts.  Proactively identify opportunities and risks while ensuring that they are reflected in forecast or budget.  Work with business partners to identify and develop solutions that help mitigate risk items.\n  \n• Opportunity to work on assignments outside of fee reporting duties, gaining exposure to different areas of Dollar Bank.\n  \n• Assist with reporting and budget\/forecast development for Branch Banking and Residential Lending Divisions of Dollar Bank.  Prepare and distribute monthly budget variance reports to business units within these divisions.\n  \n• Respond to other ad hoc inquiries and\/or reporting needs.\n  \n\n  \nQualifications:\n  \n\n  \n• Bachelor’s Degree in Finance \/ Accounting or related area required.\n  \n• Minimum of 3 years’ of financial analysis experience (preferably at a financial institution) required.\n  \n• Working knowledge of Hyperion Essbase and Oracle required.\n  \n• Strong PC skills including Microsoft Excel, Word, Access, and PowerPoint.  Proficiency with intermediate\/advanced excel skills for data analysis is essential.\n  \n• Knowledge of banking fee items such as Overdraft, ATM, Debit Card, Credit Card, Deposits, and Treasury Management a plus.\n  \n• Ability to demonstrate an understanding of the big picture, while working through the details required to constructing a budget \/ forecast.\n  \n• Detailed oriented, diligent with strong organizational and analytical skills.\n  \n• Strong interpersonal skills for effective interaction with business partners.\n  \n• A demonstrated ability to work independently.\n  \n• Exceptional organizational skills with the ability to manage multiple competing priorities while consistently meeting deadlines.\n  \n• Effective written and verbal communication skills.\n  \n• A proactive, action-oriented approach to problem solving.\n  \n**Address:**  Three Gateway Center\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8:45AM-5:00PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Budget Analyst II","url":"http:\/\/dollarbankcareers.jobs\/B5CC7139AF7E4CA3AE1BF6388719CB0124","date_new":"2018-06-16 04:50:04","reqid":"2285BR","country_short":"USA","uid":null,"guid":"B5CC7139AF7E4CA3AE1BF6388719CB01","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Pittsburgh","description":"Hours of this position are Monday through Friday 1:00 PM to 9:15 PM\n  \n\n  \nAs a ACH Processor you will be a member of Dollar Bank’s Automated Clearing House Operations team. The purpose of this position is to facilitate the receipt and origination of ACH transactions for Dollar Bank retail and corporate customers. Candidates will perform multiple job functions related to the processing of ACH transactions. You will use your research skills and risk avoidance skills to accurately and efficiently insure that files are processed within established guidelines and meet critical deadlines.\n  \n\n  \nPRINCIPAL ACTIVITIES \/ OBJECTIVES:\n  \n\n  \n•Process incoming and outgoing ACH files.\n  \n•Monitor established ACH risk controls.\n  \n•Provide statistical reporting to management.\n  \n•Possess a thorough knowledge and understanding of the ACHplus software package.\n  \n•Process new client set-up in ACHplus.\n  \n•Balance with Federal Reserve, Accounting, and internal General Ledger system on a daily basis.\n  \n•Research and answer customer inquiries.\n  \n•Process non-complex reclamations from Federal Government Agencies and other originators within appropriate time frames.\n  \n•Insure daily functions are completed accurately and within the deadlines of the department.\n  \n•Complete additional duties as assigned.\n  \n\n  \nQUALIFICATIONS:\n  \n•High School Diploma\/GED required.\n  \n•Working knowledge of ACH is required, including good balancing skills and an understanding of debit and credit transactions; banking experience is preferred.\n  \n•Ability to demonstrate good problem solving and technical skills, as well as an attention to detail and a good math aptitude.\n  \n•Must be a highly motivated self-starter, a team player, flexible, and lead by example.\n  \n•Proficient computer skills including Microsoft with the ability to learn multiple applications and maneuver between multiple applications.\n  \n•Proficient Excel skills are preferred.\n  \n•Must possess good written and verbal communication skills, as well as strong customer service skills.\n  \n•Ability to move large sums of money within established policies and operating procedures.\n  \n•Must be willing to learn State and Federal Regulations, including but not limited to Regulation J, Regulation E, UCC Law, OFAC and NACHA.\n  \n•Must be willing to learn NACHA (National Automated Clearing House Association) rules regarding credit and debit processing requirements.\n  \n•Must be willing to begin studying and passing the National Automated Clearing House Association Accredited ACH Professional Certification test.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  Monday-Friday, 1PM-9:15PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"ACH Clerk","url":"http:\/\/dollarbankcareers.jobs\/21797D8A541343D08DFD19A74CAAE94324","date_new":"2018-06-16 04:50:03","reqid":"2282BR","country_short":"USA","uid":null,"guid":"21797D8A541343D08DFD19A74CAAE943","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Pittsburgh","description":"The Customer Service Center Representative is responsible for processing telephone transactions, inquiries\/requests from Pittsburgh and Cleveland customers. The Representative must implement customer service techniques to reflect a positive image for the Bank. Representatives perform typical banking functions by phone, instruct customers about Push-Button Banking, and are the Bank's primary telephone contacts with its customers. This position requires employee to work a rotating schedule including some evenings and Saturdays. The Customer Service Center is open Monday through Friday from 8:00 am-8:00 pm and Saturday from 9:00 am-3:00 pm.\n  \n\n  \nDescription of Duties\n  \n\n  \n•Services Pittsburgh and Cleveland customers accurately, courteously and efficiently processing payments, transfers, stop payments, product\/account inquiries, histories, concerns and requests. These duties cross system lines and include all loan and deposit products as well as Internet based applications. Instructs customers about using Push-Button Banking.\n  \n•Recognizes sales opportunities and refers sales leads to Account Sales. The Representative is responsible for performing a quick analysis of the customer's needs based on account activity and product knowledge.\n  \n•Adheres to Bank regulations, policies, and procedures in performing daily assignments and tasks.\n  \n•Executes professional customer service techniques in servicing customers and in resolving customer concerns. Also, acts as liaison to other departments in solving customer concerns.\n  \n•Records and resolves specific problems using knowledge of Dollar Banks’ software systems.\n  \n•Provides customer feedback and product development information to Marketing.\n  \n•Active participation in ongoing customer service and sales training.\n  \n•Other duties as assigned.\n  \n\n  \nSkills and Experience Required\n  \n\n  \n•High school diploma or GED required; college degree preferred.\n  \n•Strong customer service orientation and experience.\n  \n•Excellent verbal and written communication skills.\n  \n•Ability to assess customer needs and respond to them.\n  \n•Ability to diplomatically handle emotionally charged situations.\n  \n•Ability to learn Dollar Bank retail products\/services, regulations, policies and procedures.\n  \n•Proficient with Microsoft Office.\n  \n•Ability to work independently and with a group, and be able to adapt to a changing environment.\n  \n•Excellent organizational and time management skills.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  This position works a rotating schedule including some evenings and Saturdays. The Customer Service Center is open Monday through Friday from 8:00 am-8:00 pm and Saturday from 9:00 am-3:00 pm.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \n\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit\n  \n\n  \nhttp:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Customer Service Center Representative (Services)","url":"http:\/\/dollarbankcareers.jobs\/3F93362BBFEF48E5A1E36CF6089F82FB24","date_new":"2018-06-16 04:50:03","reqid":"2294BR","country_short":"USA","uid":null,"guid":"3F93362BBFEF48E5A1E36CF6089F82FB","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Beachwood","description":"Job Overview:\n  \n\n  \nDevelop relationships with current and prospective customers with the goal of generating opportunities to promote the Bank’s products and services in the workplace and obtain new customer relationships. Loan Center Representative will be responsible for generating new consumer loans and its associated products and services through various proactive efforts.\n  \n\n  \nQualifications:\n  \n\n  \n• A minimum of 1 year of related sales experience required with a proven track record of achieving desired results required.\n  \n• High School Diploma\/GED required. Bachelor’s degree strongly preferred.\n  \n• Demonstrated ability and desire to consistently deliver quality service and build customer relationships.\n  \n• Excellent written and verbal communication skills and ability to conduct formal presentations.\n  \n• Demonstrated proactive techniques, creativity, resourcefulness, and self-motivation in producing results.\n  \n• Working knowledge of Microsoft Word and Excel.\n  \n• Demonstrated ability to manage and perform multiple tasks while delivering professional results.\n  \n• Access to reliable transportation required.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Personally provide quality customer service to all internal and external customers.\n  \n• Achieve all goals by consistently implementing effective relationship building techniques taught in training and consistent with the Bank’s service philosophy and business standards.\n  \n• Consistently generate new loan production and the associated products and services through proactive efforts including: utilization of effective outbound calling efforts, networking and community events, soliciting current customers within the branch (in-branch only), handling CHAT inquiries and through participation in trade shows.\n  \n• Identify businesses and key business owners within the community that may lead to new Preferred Referral Sources (Vendors).\n  \n• Attend a minimum of one networking activity each month that helps to generate new asset or referral opportunities.\n  \n• Adhere to all operational processes and procedures that have been put in place within the loan center assigned.\n  \n• Comply with all Federal and State Banking regulations that apply.\n  \n\n  \nPhysical Requirements and Working Conditions:\n  \nPerform sedentary to light work (able to lift up to 20 pounds from floor to waist, and\/or a negligible amount of force constantly to lift, carry, push, pull, grasp, or otherwise move objects). See, hear, talk and perform tasks requiring manual dexterity and visual acuity; sit, stand, walk, crouch,  reach, pull, push and other similar, repetitive tasks requiring physical activity. Able to operate standard office\/computer equipment such as photocopiers, fax machines, computers, iPads, scanners, calculators, etc.\n  \n\n  \nNote:\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  26949 Chagrin Boulevard\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Mon-Thurs: 8:30am - 5:15pm\n  \nFri: 8:30am - 7:15pm\n  \nSat: 8:30m - 2:15pm\n  \n\n  \nMay work overtime as needed.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Loan Center Representative, Beachwood","url":"http:\/\/dollarbankcareers.jobs\/BADC6B0239924C7AA9BE3B1CF18E665B24","date_new":"2018-06-15 03:14:11","reqid":"2289BR","country_short":"USA","uid":null,"guid":"BADC6B0239924C7AA9BE3B1CF18E665B","company":"Dollar Bank FSB","location":"Beachwood, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Brecksville","description":"Dollar Bank, a solid and progressive financial institution since 1855 continues to expand our business and is currently seeking a Customer Service Specialist for its Brecksville branch.\n  \n\n  \nJOB FUNCTION \/ PURPOSE:\n  \n\n  \nAs a Customer Service Specialist, you will be responsible for identifying our customers’ financial needs by providing a thorough analysis and recommending the most appropriate Dollar Bank products and services to fulfill those needs. You will use your customer service experience, product knowledge and positive demeanor to initiate, expand and retain customer relationships through customer conversations and outbound calling. We are looking for flexible, enthusiastic, hardworking individuals with a sincere appreciation for people and an empathetic communication style to proactively contribute to the branch sales and service goals.\n  \n\n  \nPRINCIPAL ACTIVITIES \/ OBJECTIVES:\n  \n\n  \nIn a typical banking day you will enjoy a high level of customer contact. The primary focus of this role includes:\n  \n•Providing quality customer service in a positive, courteous and enthusiastic manner to all internal and external customers\n  \n•Contributing to the growth and retention of deposit and loan customers. Demonstrating a proactive sales approach to building customer relationships, effectively utilizing the customer conversations to promote Dollar Bank products and services and meeting the established Relationship Building goals set by your management team.\n  \n•Performing teller functions based upon the needs of the branch. Maintaining an acceptable balancing record while processing transactions in an accurate and efficient manner.\n  \n•Adhering to all established branch operational processes and procedures.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \nThe successful candidate will have the following qualifications:\n  \n\n  \n•High school diploma\/GED required.\n  \n•College degree required, or a minimum of 1 year demonstrated ability to deliver outstanding customer service in financial services or retail industry.\n  \n•Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n•Ability to work a flexible schedule including evenings and Saturdays.\n  \n•Ability to travel as needed to training.\n  \n•Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \n**Address:**  7500 Chippewa Road\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  Monday-Thursday: 8:30am - 5:30pm\n  \nFriday: 8:30am - 7:30pm\n  \nSaturday: 8:30 am - 2:30 pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Customer Service Specialist, Brecksville","url":"http:\/\/dollarbankcareers.jobs\/0259AEBCB50743CAA1C9F5748AC9041A24","date_new":"2018-06-15 03:14:10","reqid":"2272BR","country_short":"USA","uid":null,"guid":"0259AEBCB50743CAA1C9F5748AC9041A","company":"Dollar Bank FSB","location":"Brecksville, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Pittsburgh","description":"DUTIES:\n  \n\n  \n• Process transactions through the teller equipment on all retail and corporate accounts, including, but not limited to, deposits, withdrawals, transfers, loan payments, and cash advances.\n  \n• Issue money orders, cashier checks, gift cards, and savings bonds.\n  \n• Maintains cash flow and security drawers, terminals and other valuables.\n  \n• Maintain a professional appearance and conduct yourself in a professional manner at all times.\n  \n• Process transactions in an accurate and efficient manner while providing quality customer service.\n  \n• Develop a thorough knowledge of Bank products and guidelines by attending the required classes in DBU.\n  \n• Meet established referral goals.\n  \n• Ability to manage a teller window while maintaining an acceptable balancing record and meeting the Bank’s standard of 30 transactions per hour.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \n• High school diploma or GED required.\n  \n• Six months customer service and\/or cash handling experience required. Will also consider related experience such as accounts payable, bookkeeping, or budgeting. Previous teller experience preferred.\n  \n• Must be a team player, flexible and lead by example; must be a highly motivated self-starter.\n  \n• Excellent interpersonal skills and professional manner.\n  \n• Ability to lift a minimum of 3-5 pounds of heavy coin required.\n  \n• Ability to stand on feet for long periods of time required.\n  \n• Professional communication skills and appearance are required.\n  \n• Proficient computer skills and math aptitude required.\n  \n• Must be available to attend scheduled training in the Strip District.\n  \n**Address:**  Crafton-Ingram Shopping Center\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  This branch is open Monday-Wednesday 9:00am - 4:30, Thursday 9:00am - 6:00pm, Friday 9:00am - 7:00pm, and Saturday 9:00am - 3:00pm.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \n\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit\n  \nhttp:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Full-time Teller Trainee, Crafton","url":"http:\/\/dollarbankcareers.jobs\/1113E22FBD8D45C48E50C9C5DB74A52B24","date_new":"2018-06-15 03:14:10","reqid":"2293BR","country_short":"USA","uid":null,"guid":"1113E22FBD8D45C48E50C9C5DB74A52B","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Bridgeville","description":"JOB FUNCTION \/ PURPOSE:\n  \n\n  \nAs a Customer Service Specialist, you will be responsible for identifying our customers’ financial needs by providing a thorough analysis and recommending the most appropriate Dollar Bank products and services to fulfill those needs. You will use your customer service experience, product knowledge and positive demeanor to initiate, expand and retain customer relationships through customer conversations and outbound calling. We are looking for flexible, enthusiastic, hardworking individuals with a sincere appreciation for people and an empathetic communication style to proactively contribute to the branch sales and service goals.\n  \n\n  \nPRINCIPAL ACTIVITIES \/ OBJECTIVES:\n  \n\n  \nIn a typical banking day you will enjoy a high level of customer contact. The primary focus of this role includes:\n  \n• Providing quality customer service in a positive, courteous and enthusiastic manner to all internal and external customers\n  \n• Contributing to the growth and retention of deposit and loan customers. Demonstrating a proactive sales approach to building customer relationships, effectively utilizing the customer conversations to promote Dollar Bank products and services and meeting the established Relationship Building goals set by your management team.\n  \n• Performing teller functions based upon the needs of the branch. Maintaining an acceptable balancing record while processing transactions in an accurate and efficient manner.\n  \n• Adhering to all established branch operational processes and procedures.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \nThe successful candidate will have the following qualifications:\n  \n• High school diploma\/GED required.\n  \n• College degree required, or a minimum of 1 year demonstrated ability to deliver outstanding customer service in financial services or retail industry.\n  \n• Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n• Ability to work a flexible schedule including evenings and Saturdays.\n  \n• Ability to travel as needed to training.\n  \n• Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \n**Address:**  160 Millers Run Road\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  The branch is open Monday through Thursday 9:00 a.m. to 5:00 p.m., Friday 9:00 a.m. to 7:00 p.m., and Saturday 9:00 a.m. to 2:00 p.m.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Customer Service Specialist","url":"http:\/\/dollarbankcareers.jobs\/367DBFE4C448450EAFB08FD02335E9CB24","date_new":"2018-06-15 03:14:10","reqid":"2299BR","country_short":"USA","uid":null,"guid":"367DBFE4C448450EAFB08FD02335E9CB","company":"Dollar Bank FSB","location":"Bridgeville, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Virginia Beach","description":"The Human Resources Specialist is responsible for administering, performing, and coordinating HR functions and assisting with the recruitment process including recruiting Teller positions as needed with direction from the Human Resources Officer. Recruiting is defined as proper usage of the Applicant Tracking System (ATS) to review applicants, pre-screening calls to qualified applicants, and interviewing process. The HR Specialist is responsible for all administrative functions of the department including onboarding, benefits presentation, and fingerprinting.\n  \n\n  \nQualifications:\n  \n\n  \n•Associate Degree required. Will consider commensurate experience.\n  \n•1-3 years’ experience with HR recruiting techniques to include ATS and HRIS (Lawson preferred) required; minimum of 1 year prior administrative experience required. Prior customer service experience in retail or banking environment preferred.\n  \n•Must display professional communication skills and ability to deal with all levels of management.\n  \n•Must be able to use discretion in dealing with confidential matters.\n  \n•Must be creative in approach to problems and issues.\n  \n•Must be able to effectively prioritize multiple tasks, follow up, and focus on details.\n  \n•Must be proficient in Microsoft Office Word and Excel. (Candidate will be tested.)\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n•Recruit for Teller level positions including interviewing, discussing candidates with hiring manager, make offers under the direction of the HR Officer.\n  \n•Responsible for job postings, applicant tracking and hiring activities in Kenexa along with onboarding functions.\n  \n•Conduct new employee orientation to include fingerprinting and benefits.\n  \n•Draft routine letter, memos, emails and other correspondence in response to inquiries, complaints and\/or requests for assistance.\n  \n•Participate in educational opportunities, read professional publications and maintain a good understanding of changing HR best practices.\n  \n•Complete special assignments including researching additional outreach opportunities, assisting in training of interns within the department and other tasks as assigned.\n  \n\n  \n**Address:**  501 S. Independence Blvd\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  Monday - Friday\n  \n8:30am - 5:30pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollarbank.com\/careers\/training_and_benefits.aspx .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Human Resources Specialist","url":"http:\/\/dollarbankcareers.jobs\/74FEC065CDBD41E884E953AEA945AA1724","date_new":"2018-06-15 03:14:10","reqid":"2297BR","country_short":"USA","uid":null,"guid":"74FEC065CDBD41E884E953AEA945AA17","company":"Dollar Bank FSB","location":"Virginia Beach, VA","state":"Virginia","state_short":"VA"},{"country":"United States","city":"Pittsburgh","description":"JOB FUNCTION \/ PURPOSE:\n  \nAs an Assistant Branch Manager Trainee you will complete a 12-18 month training program in a Floating capacity to become an Assistant Branch Manager. You will be responsible for identifying our customers’ financial needs by providing a thorough analysis and recommending the most appropriate Dollar Bank products and services to fulfill those needs. You will use your sales and customer service experience, product knowledge and positive demeanor to initiate, expand and retain customer relationships through customer conversations and outbound calling.  We are looking for flexible, enthusiastic, hardworking individuals with a sincere appreciation for people and an empathetic communication style to proactively contribute to the branch Relationship Building and Customer Service goals. Candidate will support multiple branch locations in a specified region.\n  \n\n  \nPRINCIPAL ACTIVITIES \/ OBJECTIVES:\n  \nIn a typical banking day you will enjoy a high level of customer contact.  The primary focus of this role includes:\n  \n•Providing quality customer service in a positive, courteous and enthusiastic manner to all internal and external customers.\n  \n•Directly impacting the growth and retention of deposit and loan customers.  Demonstrating a proactive sales approach to building customer relationships through customer conversations, lobby engagement, effectively utilizing the customer conversations to promote Dollar Bank products and services and meeting the established Relationship Building goals set by your management team.\n  \n•Performing teller functions based upon the needs of the branch. Maintaining an acceptable balancing record while processing transactions in an accurate and efficient manner.\n  \n•Adhering to all established branch operational processes and procedures.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \nThe successful candidate will have the following qualifications:\n  \n•Bachelor degree is required.  Will consider commensurate experience\n  \n•A minimum of 6 months demonstrated track record of achieving sales goals and demonstrated ability to deliver outstanding customer service in financial services or retail industry is required.\n  \n•Supervisory or leadership experience is required.\n  \n•Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n•Valid driver’s license and access to a reliable vehicle is required.\n  \n•Ability to work a flexible schedule including evenings and Saturdays.\n  \n•Ability to travel as needed to training and\/or multiple branch locations.\n  \n•Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \n**Address:**  Three Gateway Center\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  This position will travel to our branches located in the North region of Pittsburgh. This will include branches with evening and Saturday hours.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Assistant Branch Manager Trainee - North Region","url":"http:\/\/dollarbankcareers.jobs\/8FF61F5E228C410D82BA3A0ED8E236C924","date_new":"2018-06-15 03:14:10","reqid":"2304BR","country_short":"USA","uid":null,"guid":"8FF61F5E228C410D82BA3A0ED8E236C9","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Virginia Beach","description":"Job Function \/ Purpose:\n  \nOriginate quality saleable mortgage loan applications from assigned Dollar Bank branches and various referral sources including, Realtors, financial planners, attorneys, and other professional contacts.\n  \n\n  \nPrinciple Activities \/ Objectives:\n  \n-Enter all data required to complete a residential mortgage application in the loan originations system.\n  \n-Provide buyer with all required early disclosures.\n  \n-Assist borrowers by explaining lending programs and all required information needed to complete the mortgage process.\n  \n-Properly quote interest rates for loan programs offered and lock-in the interest rate at the time of the borrower's request.\n  \n-Achieve assigned production goals\n  \n-Actively network with Realtors and other professional referral sources. Attend networking functions and trade shows as determined b management.\n  \n-Oversee active pipeline of mortgages from application to closing and work closely with the operations personnel to assist in processing the application when needed.\n  \n-Work closely with branch personnel of assigned branches. Attend meetings and branch events as assigned.\n  \n\n  \nQualifications:\n  \n-3+ years of originating mortgage loan applications.\n  \n-Excellent communication and organizational skills\n  \n-Knowledge of Freddie Mac, Fannie Mae, FHA and VA underwriting guidelines.\n  \n-Software knowledge including; Point of sale first mortgage loan origination system, Microsoft Word and Excel.\n  \n**Address:**  501 S. Independence Blvd\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Flexible Schedule\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollarbank.com\/careers\/training_and_benefits.aspx .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Mortgage Loan Originator","url":"http:\/\/dollarbankcareers.jobs\/FFE989C340464A40AAD365946431CE7124","date_new":"2018-06-14 03:28:36","reqid":"2301BR","country_short":"USA","uid":null,"guid":"FFE989C340464A40AAD365946431CE71","company":"Dollar Bank FSB","location":"Virginia Beach, VA","state":"Virginia","state_short":"VA"},{"country":"United States","city":"Pittsburgh","description":"JOB FUNCTION \/ PURPOSE:\n  \n\n  \nThe Treasury Management Sales Support Admin. is responsible for assisting Treasury Management (TM) sales representatives with development of TM business. Primary responsibilities include coordination and support of client product implementations, daily customer service needs, complex service issues, and continuous support.  This position services as the liaison between TM and the customer for all phone calls, issues, concerns, operational needs and general “online systems support”.   This role also provides training to customers on features and functions of services and products coupled with general administrative assistance to TM Sales Officers with the coordination of sales of TM products.\n  \n\n  \nThe TM Sales Support Admin. is also responsible for development of automated and manual risk reporting routines for specified products.  This role will be required to advise TM representatives and management of potential risks based upon technical knowledge and best practices.\n  \n\n  \nPRINCIPLE DUTIES\/RESPONSIBILITIES:\n  \n•Provide general customer support for TM Sales Officers; process customer requests for assistance with treasury management products and services; research inquiries regarding overdrafts, transfers, service charges, and account performance.\n  \n•Analyze risk review process as assigned for ACH, Wire Transfer, Remote Deposit or Funds Availability as required.\n  \n•Analyze and monitor specific assigned risk functions for ACH, Wire Transfer, Remote Deposit or Funds Availability as required for any designated customer.\n  \n•Implement sold TM services:\n  \no Opening new accounts, order checks, endorsement stamps as needed.\n  \no Preparing and mail welcome packets.\n  \no Completing documentation (regulatory and internal) to successfully implement all sold products and services (service agreements\/riders).\n  \n•Implement new business set-up of TM products and services including pre\/post sale customer documentation.\n  \n•Sustain an ongoing understanding of TM products and services; keep abreast of regulatory and policy changes affecting TM to ensure compliance.\n  \n•Consistently address and manage escalated client issues.\n  \n•Initiate updates to procedure manual as needed.\n  \n•Maintain ongoing communication with internal and external customers for the successful implementation of TM services and account maintenance.\n  \n\n  \nQUALIFICATIONS:\n  \n•College degree or banking\/admin. experience required.\n  \n•Knowledge of banking depository, cash management products, banking systems and branch operations recommended.\n  \n•Strong analytical skills; ability to navigate systems, access data, reconcile numbers, identify discrepancies and understand drivers of change within data.\n  \n•Effective oral and written communications.\n  \n•Ability to resolve escalated client issues and proactively diffuse conflict.\n  \n•Proficient in MS Office, specifically Word (Candidate will be tested).\n  \n**Address:**  Three Gateway Center\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  Monday-Friday, 8:30am-4:45pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Administrative Assistant","url":"http:\/\/dollarbankcareers.jobs\/F6C5671503344CCD96708F084E44E14624","date_new":"2018-06-12 05:13:35","reqid":"2173BR","country_short":"USA","uid":null,"guid":"F6C5671503344CCD96708F084E44E146","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Richmond Heights","description":"Dollar Bank, a solid and progressive financial institution since 1855 continues to expand our business and is currently seeking a Customer Service Specialist for its Richmond Heights branch.\n  \n\n  \nJOB FUNCTION \/ PURPOSE:\n  \n\n  \nAs a Customer Service Specialist, you will be responsible for identifying our customers’ financial needs by providing a thorough analysis and recommending the most appropriate Dollar Bank products and services to fulfill those needs. You will use your customer service experience, product knowledge and positive demeanor to initiate, expand and retain customer relationships through customer conversations and outbound calling. We are looking for flexible, enthusiastic, hardworking individuals with a sincere appreciation for people and an empathetic communication style to proactively contribute to the branch sales and service goals.\n  \n\n  \nPRINCIPAL ACTIVITIES \/ OBJECTIVES:\n  \n\n  \nIn a typical banking day you will enjoy a high level of customer contact. The primary focus of this role includes:\n  \n•Providing quality customer service in a positive, courteous and enthusiastic manner to all internal and external customers\n  \n•Contributing to the growth and retention of deposit and loan customers. Demonstrating a proactive sales approach to building customer relationships, effectively utilizing the customer conversations to promote Dollar Bank products and services and meeting the established Relationship Building goals set by your management team.\n  \n•Performing teller functions based upon the needs of the branch. Maintaining an acceptable balancing record while processing transactions in an accurate and efficient manner.\n  \n•Adhering to all established branch operational processes and procedures.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \nThe successful candidate will have the following qualifications:\n  \n\n  \n•High school diploma\/GED required.\n  \n•College degree required, or a minimum of 1 year demonstrated ability to deliver outstanding customer service in financial services or retail industry.\n  \n•Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n•Ability to work a flexible schedule including evenings and Saturdays.\n  \n•Ability to travel as needed to training.\n  \n•Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \n**Address:**  5201 Wilson Mills Road\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  Monday-Thursday 8:30am-5:30pm\n  \nFriday 8:30am-7:30pm\n  \nSaturday 8:30am-2:30pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Customer Service Specialist, Richmond Heights","url":"http:\/\/dollarbankcareers.jobs\/D3C0002D67704B629C58AB50B055205424","date_new":"2018-06-12 05:13:34","reqid":"2276BR","country_short":"USA","uid":null,"guid":"D3C0002D67704B629C58AB50B0552054","company":"Dollar Bank FSB","location":"Richmond Heights, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Canton","description":"The Desktop Support Technician II is responsible for the mid-level support and maintenance of all computer equipment and end user technical support at Dollar Bank Servicing Center.\n  \n\n  \nQualifications:\n  \n\n  \n• Bachelor’s Degree preferred in Computer Science, Information Systems, or other related field. Will accept minimum of four years of professional work experience in lieu of education.\n  \n• Must have at least two years of extensive personal computer experience and at least two years of network experience.\n  \n• This network experience should include but not be limited to installing and trouble-shooting network hardware\/software, as well as training and supporting users in a Windows\/Ethernet environment.\n  \n• Must have a fundamental knowledge of computers and operating systems.\n  \n• Fundamental experience with desktop troubleshooting and resolving printer and multifunction device issues.\n  \n• A strong knowledge of networking protocols, especially TCP\/IP is also required.\n  \n• Ability to work independently with minimal supervision.\n  \n• Willingness to learn and keep abreast of new skills and techniques.\n  \n• Good organizational skills and the ability to multi-task.\n  \n• Must possess excellent communication skills, both written and oral.\n  \n• Ability to analyze and anticipate situations.\n  \n• Must have the ability to lift 25 pounds.\n  \n• Must have a valid driver’s license.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• End User Support – Provide mid-level troubleshooting of software, hardware, peripherals and printers. Escalate to Level 3 after 1 day of troubleshooting.\n  \n• Desktop Lifecycle Management – Design and create master operating system images. Coordinate with end-users and the Level 1 team to provide a timely workstation installation and\/or replacement.\n  \n• Laptop Management – Manage the laptop lifecycle process. Assist the Inventory Management Team with the documentation process and end-user signoff. Secure laptops with the installation and configuration of encryption software. Coordinate with internal teams to install and configure the bank’s VPN software.\n  \n• User Education – Provide end-users with intermediate computer training, to ensure projects are delivered on time, within budget, adhere to high quality standards and meet customer expectations.\n  \n• Responsible for assembling project plans and teamwork assignments, directing and monitoring work efforts on a daily basis, identifying resource needs, performing quality review; and escalating functional, quality, timeline issues appropriately. Responsible for tracking key project milestones and adjusting project plans and\/or resources to meet the needs of customers.\n  \n• Assist Level 3 with Image design and development\n  \n\n  \nPhysical Requirements and Working Conditions:\n  \nPerform sedentary to light work (able to lift up to 20 pounds from floor to waist, and\/or a negligible amount of force constantly to lift, carry, push, pull, grasp, or otherwise move objects). See, hear, talk and perform tasks requiring manual dexterity and visual acuity; sit, stand, walk, crouch, reach, pull, push and other similar, repetitive tasks requiring physical activity. Able to operate standard office\/computer equipment such as photocopiers, fax machines, computers, iPads, scanners, calculators, etc.\n  \n**Address:**  City Center Tower\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday - Friday 8:30 AM - 5:00 PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Desktop Support Technician II","url":"http:\/\/dollarbankcareers.jobs\/B717051A3891470D8FEF3BAFF82E8E2324","date_new":"2018-06-09 06:47:07","reqid":"2283BR","country_short":"USA","uid":null,"guid":"B717051A3891470D8FEF3BAFF82E8E23","company":"Dollar Bank FSB","location":"Canton, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Cleveland","description":"Dollar Bank is currently seeking a Part Time Teller for its Public Square office.\n  \n\n  \nDUTIES:\n  \n\n  \n• Process transactions through the teller equipment on all retail and corporate accounts, including, but not limited to, deposits, withdrawals, transfers, loan payments, and cash advances.\n  \n• Issue money orders, cashier checks, gift cards, and savings bonds.\n  \n• Initiate conversations to uncover customer needs and promote Dollar Bank products and services, and effectively refer customers to appropriate team members when needed.\n  \n• Act with confidence by helping customers with their questions, and take initiative and use sound judgment in decision-making and problem resolution.\n  \n• Promote good customer relations by consistently providing quality service with a friendly demeanor, can-do attitude, and willingness to help at all times.\n  \n• Maintain a position of trust and responsibility by keeping all customer information confidential.\n  \n• Continuously increase skills and knowledge of bank products and guidelines through self-motivation and in-house training.\n  \n• Maintain a professional appearance and manner at all times.\n  \n• Successfully complete teller assessment.\n  \n• Maintain an acceptable balancing record.\n  \n• Complete additional duties as assigned.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \n• High school diploma or GED required.\n  \n• Six months customer service or cash handling experience required.  Previous teller experience preferred.\n  \n• Must be a team player, flexible and lead by example.\n  \n• Must be a highly motivated self-starter.\n  \n• Excellent interpersonal skills and professional manner.\n  \n• Ability to work between 20-25 hours per week with the ability to work full time hours for approximately 2-3 weeks during initial training period.\n  \n• Ability to lift a minimum of 3-5 pounds of heavy coin required.\n  \n• Ability to stand on feet for long periods of time required.\n  \n• Professional communication skills and appearance are required.\n  \n• Proficient computer skills required.\n  \n• Math aptitude required.\n  \n• Must not have a negative unresolved personal financial history with Dollar Bank.\n  \n**Address:**  140 Public Square\n  \n**Employment Status:**  Part-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  Monday-Friday: 8:15AM - 5:00PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Part Time Teller Trainee, Public Square","url":"http:\/\/dollarbankcareers.jobs\/D4BB4DFA11E84B2D82B9AEE52815DA7324","date_new":"2018-06-09 06:47:07","reqid":"2291BR","country_short":"USA","uid":null,"guid":"D4BB4DFA11E84B2D82B9AEE52815DA73","company":"Dollar Bank FSB","location":"Cleveland, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Elyria","description":"Dollar Bank is currently seeking a Part Time Teller for its Midway-Elyria office.\n  \n\n  \nDUTIES:\n  \n\n  \n• Process transactions through the teller equipment on all retail and corporate accounts, including, but not limited to, deposits, withdrawals, transfers, loan payments, and cash advances.\n  \n• Issue money orders, cashier checks, gift cards, and savings bonds.\n  \n• Initiate conversations to uncover customer needs and promote Dollar Bank products and services, and effectively refer customers to appropriate team members when needed.\n  \n• Act with confidence by helping customers with their questions, and take initiative and use sound judgment in decision-making and problem resolution.\n  \n• Promote good customer relations by consistently providing quality service with a friendly demeanor, can-do attitude, and willingness to help at all times.\n  \n• Maintain a position of trust and responsibility by keeping all customer information confidential.\n  \n• Continuously increase skills and knowledge of bank products and guidelines through self-motivation and in-house training.\n  \n• Maintain a professional appearance and manner at all times.\n  \n• Successfully complete teller assessment.\n  \n• Maintain an acceptable balancing record.\n  \n• Complete additional duties as assigned.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \n• High school diploma or GED required.\n  \n• Six months customer service or cash handling experience required.  Previous teller experience preferred.\n  \n• Must be a team player, flexible and lead by example.\n  \n• Must be a highly motivated self-starter.\n  \n• Excellent interpersonal skills and professional manner.\n  \n• Ability to work between 20-25 hours per week with the ability to work full time hours for approximately 2-3 weeks during initial training period.\n  \n• Ability to lift a minimum of 3-5 pounds of heavy coin required.\n  \n• Ability to stand on feet for long periods of time required.\n  \n• Professional communication skills and appearance are required.\n  \n• Proficient computer skills required.\n  \n• Math aptitude required.\n  \n• Must not have a negative unresolved personal financial history with Dollar Bank.\n  \n**Address:**  1500 W. River Road North\n  \n**Employment Status:**  Part-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  Monday-Friday: 8:30AM - 7:30PM\n  \nSaturday: 8:30AM - 2:30PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Part Time Teller Trainee, Midway-Elyria","url":"http:\/\/dollarbankcareers.jobs\/13F0AF6F57AF4E78B91FEFE2D663A31D24","date_new":"2018-06-09 06:47:06","reqid":"2292BR","country_short":"USA","uid":null,"guid":"13F0AF6F57AF4E78B91FEFE2D663A31D","company":"Dollar Bank FSB","location":"Elyria, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Virginia Beach","description":"As a Customer Service Specialist, you will be responsible for identifying our customers’ financial needs by providing a thorough analysis and recommending the most appropriate Dollar Bank products and services to fulfill those needs. You will use your customer service experience, product knowledge and positive demeanor to initiate, expand and retain customer relationships through customer conversations and outbound calling.  We are looking for flexible, enthusiastic, hardworking individuals with a sincere appreciation for people and an empathetic communication style to proactively contribute to the branch sales and service goals.\n  \n\n  \nThis branch is a new branch expected to open in the 4th quarter of 2018.\n  \n\n  \nQualifications:\n  \n•High school diploma\/GED required\n  \n•College degree required, or a minimum of 1 year demonstrated ability to deliver outstanding customer service in financial services or retail industry.\n  \n•Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n•Ability to work a flexible schedule including evenings and Saturdays.\n  \n•Ability to travel as needed to training.\n  \n•Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \n\n  \nPrinciple Activities and Duties:\n  \n•Providing quality customer service in a positive, courteous and enthusiastic manner to all internal and external customers\n  \n•Contributing to the growth and retention of deposit and loan customers. Demonstrating a proactive sales approach to building customer relationships, effectively utilizing the customer conversations to promote Dollar Bank products and services and meeting the established Relationship Building goals set by your management team.\n  \n•Performing teller functions based upon the needs of the branch. Maintaining an acceptable balancing record while processing transactions in an accurate and efficient manner.\n  \n•Adhering to all established branch operational processes and procedures.\n  \n\n  \nPhysical Requirements and Working Conditions:\n  \nPerform sedentary to light work (able to lift up to 20 pounds from floor to waist, and\/or a negligible amount of force constantly to lift, carry, push, pull, grasp, or otherwise move objects). See, hear, talk and perform tasks requiring manual dexterity and visual acuity; sit, stand, walk, crouch,  reach, pull, push and other similar, repetitive tasks requiring physical activity. Able to operate standard office\/computer equipment such as photocopiers, fax machines, computers, iPads, scanners, calculators, etc.\n  \n**Address:**  501 S. Independence Blvd\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  Mon-Thurs\n  \n9am - 5pm\n  \nFriday\n  \n9am - 6pm\n  \nSaturday\n  \n9am - 12pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollarbank.com\/careers\/training_and_benefits.aspx .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Customer Service Specialist","url":"http:\/\/dollarbankcareers.jobs\/C53B5BDB748F4E65BB60234C9093B2EB24","date_new":"2018-06-07 04:50:19","reqid":"2268BR","country_short":"USA","uid":null,"guid":"C53B5BDB748F4E65BB60234C9093B2EB","company":"Dollar Bank FSB","location":"Virginia Beach, VA","state":"Virginia","state_short":"VA"},{"country":"United States","city":"Virginia Beach","description":"We are looking for enthusiastic, hardworking individuals with a sincere appreciation for people and an empathetic communication style that can assume a leadership role, motivate and hold accountable the team members of a branch to achieve all Relationship Building, Operational Integrity and Customer Service goals. As an Assistant Branch Manager, you will work with the Branch Manager in building a motivated, customer service focused team where everyone contributes to the success of the branch. You will lead the team by example and challenge them to exceed their expectations. This is a Management position where the incumbent will participate in a six to nine month comprehensive retail banking training program.\n  \n\n  \nQualifications:\n  \n\n  \n•Bachelor’s Degree required. Will consider commensurate experience.\n  \n•Retail Banking experience preferred.\n  \n•Managerial or Leadership experience is required.\n  \n•A minimum of one year of customer service experience, including demonstrated ability to achieve sales goals and deliver outstanding customer service is required.\n  \n•Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n•Ability to work a flexible schedule including evenings and Saturdays.\n  \n•Must have a valid driver’s license and access to a reliable vehicle.\n  \n•Ability to travel as needed to training.\n  \n•Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n•Directly impacting the growth and retention of deposit and loan customers. Leading the branch in fostering a proactive approach to building customer relationships while always maintaining the highest level of professionalism, integrity and ethics.\n  \n•Providing quality customer service and placing an emphasis on increasing the proactive sales and service efforts of team members through individual coaching sessions and team meetings. It is important that the Assistant Branch Manager create an enthusiastic, energetic and positive work environment for the team to flourish.\n  \n•Upholding the operational integrity of the branch by assisting the team in all areas of branch operations and demonstrating sound decision making skills as it relates to risk, profitability and customer service.\n  \n**Address:**  839 Lynnhaven Parkway\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Mon - Thur, 9am - 5pm\n  \nFriday, 9am - 6pm\n  \nSaturday, 9am - 12pm\n  \n\n  \nRotating Schedule\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollarbank.com\/careers\/training_and_benefits.aspx .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Assistant Branch Manager","url":"http:\/\/dollarbankcareers.jobs\/F61F7F8281BE43AB960FF1D439DC67FB24","date_new":"2018-06-07 04:50:19","reqid":"2286BR","country_short":"USA","uid":null,"guid":"F61F7F8281BE43AB960FF1D439DC67FB","company":"Dollar Bank FSB","location":"Virginia Beach, VA","state":"Virginia","state_short":"VA"},{"country":"United States","city":"Virginia Beach","description":"The Branch Manager is responsible for the overall administration and efficient daily operation of a full service branch office, including operations, team development, opening accounts, lending, customer service, and security and safety in accordance with the Bank's objectives\n  \n\n  \nQualifications:\n  \n\n  \n•Demonstrated ability to deliver outstanding customer service.\n  \n•Proficient computer skills, math aptitude and attention to detail is a must.\n  \n•Demonstrated strong leadership skills and dependability.\n  \n•Effectively communicate and demonstrate strong time management skills as required.\n  \n•Able to work well under pressure and be able to meet deadlines\n  \n•Minimum three years solid management experience in a retail environment is required, including managing a staff, coaching, and meeting goals. Banking environment desirable.\n  \n•Excellent demonstrable time management, communication and motivational skills are necessary.\n  \n•Bachelor’s degree required or commensurate experience.\n  \n•Must be willing to work a flexible schedule, including some evenings and Saturdays.\n  \n•A valid driver’s license and access to a reliable vehicle is required.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n•Consistently provide quality service as outlined in the Bank’s Quality Service Statement.\n  \n•Directly impact the growth and retention of customers through proactive efforts.  This can be accomplished by managing Online RB, ensuring their team is offering customers additional products and services, and holding regular monthly call nights to follow-up on any lists created by the Marketing Department, as well as, other sources of referrals from inside the branch.\n  \n•Focus on building a customer service driven team where everyone contributes to the success of the Relationship Building and Operational efforts.\n  \n•Develop and motivate the team members of their Office by offering constructive feedback and positive reinforcement. This can be accomplished at regular team meetings and through individual documented coaching sessions. Continue the development of the Operation and Relationship Manager’s leadership skills by offering constructive feedback and positive reinforcement through individual documented coaching sessions.\n  \n•Represent Dollar Bank in the community in a professional and competent manner at all times. Is expected to source business deposit and loan relationships within the surrounding communities through active participation in various organizations and charitable functions.\n  \n•Meet the established Group Banking Onsite Visit and Checking Accounts Opened goals each month. This will be accomplished by being proactive in outside calling efforts and by taking advantage all Group Banking opportunities within his market.\n  \n•Exhibit operational knowledge while upholding the operational integrity of the office by assisting the team in all areas of branch operations including Compliance.\n  \n•Achieve all Relationship Building, Operational Integrity, and Customer Service goals.\n  \n•Exercise sound decision-making skills as it relates to balancing risk, profitability, and customer service with every decision.\n  \n•Consistently lead by example, maintain professionalism and a positive attitude at all times and exercise superior leadership skills.\n  \n**Address:**  Lynnhaven Parkway\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Mon-Thur, 9am - 5pm\n  \nFriday, 9am - 6pm\n  \nSaturday, 9am - 12pm\n  \n\n  \nRotating Schedule\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollarbank.com\/careers\/training_and_benefits.aspx .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Branch Manager","url":"http:\/\/dollarbankcareers.jobs\/43D463E57F974D489F4EE359102B9CC424","date_new":"2018-06-07 04:50:18","reqid":"2287BR","country_short":"USA","uid":null,"guid":"43D463E57F974D489F4EE359102B9CC4","company":"Dollar Bank FSB","location":"Virginia Beach, VA","state":"Virginia","state_short":"VA"},{"country":"United States","city":"Virginia Beach","description":"As a Customer Service Specialist, you will be responsible for identifying our customers’ financial needs by providing a thorough analysis and recommending the most appropriate Dollar Bank products and services to fulfill those needs. You will use your customer service experience, product knowledge and positive demeanor to initiate, expand and retain customer relationships through customer conversations and outbound calling.  We are looking for flexible, enthusiastic, hardworking individuals with a sincere appreciation for people and an empathetic communication style to proactively contribute to the branch sales and service goals.\n  \n\n  \nThis branch is a new branch expected to open in the 4th quarter of 2018.\n  \n\n  \nQualifications:\n  \n•High school diploma\/GED required\n  \n•College degree required, or a minimum of 1 year demonstrated ability to deliver outstanding customer service in financial services or retail industry.\n  \n•Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n•Ability to work a flexible schedule including evenings and Saturdays.\n  \n•Ability to travel as needed to training.\n  \n•Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \n\n  \nPrinciple Activities and Duties:\n  \n•Providing quality customer service in a positive, courteous and enthusiastic manner to all internal and external customers\n  \n•Contributing to the growth and retention of deposit and loan customers. Demonstrating a proactive sales approach to building customer relationships, effectively utilizing the customer conversations to promote Dollar Bank products and services and meeting the established Relationship Building goals set by your management team.\n  \n•Performing teller functions based upon the needs of the branch. Maintaining an acceptable balancing record while processing transactions in an accurate and efficient manner.\n  \n•Adhering to all established branch operational processes and procedures.\n  \n\n  \nPhysical Requirements and Working Conditions:\n  \nPerform sedentary to light work (able to lift up to 20 pounds from floor to waist, and\/or a negligible amount of force constantly to lift, carry, push, pull, grasp, or otherwise move objects). See, hear, talk and perform tasks requiring manual dexterity and visual acuity; sit, stand, walk, crouch,  reach, pull, push and other similar, repetitive tasks requiring physical activity. Able to operate standard office\/computer equipment such as photocopiers, fax machines, computers, iPads, scanners, calculators, etc.\n  \n**Address:**  501 S. Independence Blvd\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  Mon-Thurs\n  \n9am - 5pm\n  \nFriday\n  \n9am - 6pm\n  \nSaturday\n  \n9am - 12pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollarbank.com\/careers\/training_and_benefits.aspx .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Customer Service Specialist","url":"http:\/\/dollarbankcareers.jobs\/69FAAAFD038F4F428AF65231C28006C224","date_new":"2018-06-07 04:50:18","reqid":"2270BR","country_short":"USA","uid":null,"guid":"69FAAAFD038F4F428AF65231C28006C2","company":"Dollar Bank FSB","location":"Virginia Beach, VA","state":"Virginia","state_short":"VA"},{"country":"United States","city":"Painesville","description":"We are looking for enthusiastic, hardworking individuals with a sincere appreciation for people and an empathetic communication style that can assume a leadership role, motivate and hold accountable the team members of a branch to achieve all Relationship Building, Operational Integrity and Customer Service goals. As an Assistant Branch Manager, you will work with the Branch Manager in building a motivated, customer service focused team where everyone contributes to the success of the branch. You will lead the team by example and challenge them to exceed their expectations. This is a Management position where the incumbent will participate in a six to nine month comprehensive retail banking training program.\n  \n\n  \nQualifications:\n  \n\n  \n• Bachelor’s Degree required. Will consider commensurate experience.\n  \n• Retail Banking experience preferred.\n  \n• Managerial or Leadership experience is required.\n  \n• A minimum of one year of customer service experience, including demonstrated ability to achieve sales goals and deliver outstanding customer service is required.\n  \n• Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n• Ability to work a flexible schedule including evenings and Saturdays.\n  \n• Must have a valid driver’s license and access to a reliable vehicle.\n  \n• Ability to travel as needed to training.\n  \n• Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Directly impacting the growth and retention of deposit and loan customers. Leading the branch in fostering a proactive approach to building customer relationships while always maintaining the highest level of professionalism, integrity and ethics.\n  \n• Providing quality customer service and placing an emphasis on increasing the proactive sales and service efforts of team members through individual coaching sessions and team meetings. It is important that the Assistant Branch Manager create an enthusiastic, energetic and positive work environment for the team to flourish.\n  \n• Upholding the operational integrity of the branch by assisting the team in all areas of branch operations and demonstrating sound decision making skills as it relates to risk, profitability and customer service.\n  \n\n  \nPhysical Requirements and Working Conditions:\n  \nPerform sedentary to light work (able to lift up to 20 pounds from floor to waist, and\/or a negligible amount of force constantly to lift, carry, push, pull, grasp, or otherwise move objects). See, hear, talk and perform tasks requiring manual dexterity and visual acuity; sit, stand, walk, crouch,  reach, pull, push and other similar, repetitive tasks requiring physical activity. Able to operate standard office\/computer equipment such as photocopiers, fax machines, computers, iPads, scanners, calculators, etc.\n  \n\n  \nNote:\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  1209 Mentor Avenue\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Mon-Thurs: 8:30AM - 5:30PM\n  \nFriday: 8:30AM-7:30PM\n  \nSaturday: 8:30AM - 2:30PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Assistant Branch Manager, Painesville","url":"http:\/\/dollarbankcareers.jobs\/D7D4DDC36B30497FAB944516DD2226DA24","date_new":"2018-06-06 08:30:01","reqid":"2230BR","country_short":"USA","uid":null,"guid":"D7D4DDC36B30497FAB944516DD2226DA","company":"Dollar Bank FSB","location":"Painesville, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Pittsburgh","description":"Job Overview:\n  \n\n  \nThe Tax Accountant is responsible for supporting the Tax Department in the timely and accurate preparation of all applicable tax filings in accordance with local, state, and federal guidelines.  In addition, the Tax Accountant is responsible for maintaining the Fixed Asset System, used to calculate book and tax depreciation for the Bank and its subsidiaries.\n  \n\n  \nQualifications:\n  \n\n  \n• Minimum Bachelor’s Degree in Accounting or related field required. Will consider commensurate experience.\n  \n• Internship or accounting related work experience preferred.\n  \n• Working knowledge in Microsoft Excel preferred; Oracle a plus.\n  \n• Ability to manage time and workload efficiently.\n  \n• Ability to effectively communicate.\n  \n• Ability to pay close attention to detail with accuracy.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Assist in preparation and filing of federal corporate income tax returns.\n  \n• Assist in preparation and filing of state and local income tax returns.\n  \n• Assist in preparation and filing of estimated income tax payments.\n  \n• Assist in preparation and filing of payroll tax reports.\n  \n• Assist in preparation of state sales and use tax reports.\n  \n• Prepare and file personal property tax returns.\n  \n• Provide support to the annual filing of information returns.\n  \n• Prepare monthly income tax provision and effective tax rate.\n  \n• Prepare analysis and entries for current and deferred income tax accounts.\n  \n• Prepare tax footnote for the annual audited financial statements.\n  \n• Maintain and balance the fixed asset system and related accounts.\n  \n• Reconcile assigned ledger accounts monthly.\n  \n• Process remittances of taxes withheld.\n  \n**Address:**  Three Gateway Center\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8:15AM-4:30PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Tax Accountant I","url":"http:\/\/dollarbankcareers.jobs\/1BB74B8CD35D4241B93C76BD7405BF7C24","date_new":"2018-06-06 08:30:00","reqid":"2256BR","country_short":"USA","uid":null,"guid":"1BB74B8CD35D4241B93C76BD7405BF7C","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Pittsburgh","description":"DUTIES:\n  \n\n  \n• Process transactions through the teller equipment on all retail and corporate accounts, including, but not limited to, deposits, withdrawals, transfers, loan payments, and cash advances.\n  \n• Issue money orders, cashier checks, gift cards, and savings bonds.\n  \n• Maintains cash flow and security drawers, terminals and other valuables.\n  \n• Maintain a professional appearance and conduct yourself in a professional manner at all times.\n  \n• Process transactions in an accurate and efficient manner while providing quality customer service.\n  \n• Develop a thorough knowledge of Bank products and guidelines by attending the required classes in DBU.\n  \n• Meet established referral goals.\n  \n• Ability to manage a teller window while maintaining an acceptable balancing record and meeting the Bank’s standard of 30 transactions per hour.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \n• High school diploma or GED required.\n  \n• Six months customer service and\/or cash handling experience required.  Will also consider related experience such as accounts payable, bookkeeping, or budgeting.  Previous teller experience preferred.\n  \n• Must be a team player, flexible and lead by example; must be a highly motivated self-starter.\n  \n• Excellent interpersonal skills and professional manner.\n  \n• Ability to lift a minimum of 3-5 pounds of heavy coin required.\n  \n• Ability to stand on feet for long periods of time required.\n  \n• Professional communication skills and appearance are required.\n  \n• Proficient computer skills and math aptitude required.\n  \n• May be required at times to adjust schedule availability based on branch needs.\n  \n• Must be available to attend scheduled training in the Strip District.\n  \n**Address:**  Waterworks Mall\n  \n**Employment Status:**  Part-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  This branch is open Monday-Friday from 8:30 am - 7:00 pm and on Saturday from 8:30 am - 2:00 pm.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Part-time Teller Trainee Fox Chapel","url":"http:\/\/dollarbankcareers.jobs\/384224BF16394023BE59A74F4A0CD7A524","date_new":"2018-06-06 08:30:00","reqid":"2275BR","country_short":"USA","uid":null,"guid":"384224BF16394023BE59A74F4A0CD7A5","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Pittsburgh","description":"Job Overview:\n  \n\n  \nThe Mortgage Underwriting Officer will guarantee that all loan application packages, through thorough analysis, contain the appropriate information and documentation that is necessary to satisfy the requirements of the bank, Freddie Mac, Fannie Mae, FHA, VA, Bond Programs, URA, and various other underwriting agency guidelines. This employee will provide an approval or rejection of the loan application based on an informed underwriting decision using the above guidelines.\n  \n\n  \nQualifications:\n  \n\n  \n• Minimum of three years of underwriting experience of Conforming and Jumbo Loans, including FHA, Conventional and VA is required for this position; Reverse Mortgage and Consumer Underwriting experience is preferred.\n  \n• FHA Certification is required.\n  \n• High School Diploma\/GED required. College Degree preferred,\n  \n• Thorough knowledge of loan processing and closing procedures.\n  \n• Demonstrated ability and desire to provide high quality customer service.\n  \n• Demonstrated ability to communicate effectively both orally and in writing.\n  \n• Proven analytical skills.\n  \n• Candidate will have proficient computer skills and the ability to learn Dollar Bank’s software packages.\n  \n• Candidate must be well versed in AUS and manual underwriting methods.  Collateral Underwriter system with Fannie Mae is preferred.\n  \n• Demonstrated ability to handle a high volume of productivity.\n  \n• Must be detail oriented, organized and work efficiently under pressure.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Complete a detailed analysis of the appraisal report and loan file to insure the standard necessary to conform to the underwriting guidelines listed above.\n  \n• Accurately determine the borrower’s ability and willingness to repay the debt.\n  \n• Document the system for approval or rejection outside of the standard underwriting procedures.\n  \n• Maintain knowledge of underwriting guidelines and stay current with department requirements.\n  \n• Respond accurately to underwriting questions from the loan originators and correspondents to insure that consistent policy and procedures are followed as prescribed by the Bank.\n  \n• Assist in the development or changes in application, processing, underwriting and underwriting procedures affected by changes in the underwriting guidelines listed above or by changes in the system.\n  \n• Instruct loan processors in new procedures or the review of existing procedures.\n  \n• Review loan package(s) after initial processing step is completed to identify critical areas that could adversely affect the probability of loan approval.  Provide the appropriate follow up in these areas.\n  \n• Maintain complete awareness of quality customer service through effective communication and by presenting the Bank in a positive, professional and courteous manner.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8:15AM - 4:30PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Mortgage Underwriting Officer","url":"http:\/\/dollarbankcareers.jobs\/69C8B010F4B44B78A13D3B6BFD019F8F24","date_new":"2018-06-06 08:30:00","reqid":"2243BR","country_short":"USA","uid":null,"guid":"69C8B010F4B44B78A13D3B6BFD019F8F","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Cleveland","description":"Job Overview:\n  \n\n  \nDollar Bank is seeking an experienced Corporate Lender for its Cleveland market. The position entails calling on prospects and existing customers in an effort to source commercial banking relationships and performing functions necessary to maintain a loan portfolio.\n  \n\n  \nQualifications:\n  \n\n  \n•Bachelor’s Degree required. Will consider commensurate experience.\n  \n•Minimum of 10 years lending experience at corporate middle market level with at least 5 years in the Cleveland Market required.\n  \n•Verifiable production history of a minimum of $10 million per year required.\n  \n•Experience developing, underwriting and managing a corporate banking loan portfolio.\n  \n•Ability to analyze financial and operational strengths and weaknesses of business entities including leverage, key risk factors, industry trends, sources of repayment, cash flow and ability to service debt required.\n  \n\n  \nPhysical Requirements and Working Conditions:\n  \n\n  \nPerform sedentary to light work (able to lift up to 20 pounds from floor to waist, and\/or a negligible amount of force constantly to lift, carry, push, pull, grasp, or otherwise move objects). See, hear, talk and perform tasks requiring manual dexterity and visual acuity; sit, stand, walk, crouch,  reach, pull, push and other similar, repetitive tasks requiring physical activity. Able to operate standard office\/computer equipment such as photocopiers, fax machines, computers, iPads, scanners, calculators, etc.\n  \n\n  \nNote:\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  Tower at Erieview\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday- Friday: 8:00am-5:30pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Vice President, Lending Corporate Banking","url":"http:\/\/dollarbankcareers.jobs\/11F97D89EA9C42C287627E797BCF9D0F24","date_new":"2018-06-05 04:49:26","reqid":"2274BR","country_short":"USA","uid":null,"guid":"11F97D89EA9C42C287627E797BCF9D0F","company":"Dollar Bank FSB","location":"Cleveland, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Pittsburgh","description":"Job Overview:\n  \n\n  \nThis position is responsible for providing advanced Health Monitoring, Troubleshooting, and System Maintenance for the Distributed Services servers and systems. The Distributed Services department is responsible for over 600 servers, both physical and virtual, over 100 Microsoft SQL Database, over 150 business applications and over 70 branches throughout the Eastern United States.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n•Provide Level 2 technical support and assist with Level 1.\n  \n•Escalation of  issues to Level 3 after appropriate SLA.\n  \n•Monitor the operating system environment, troubleshoot and maintain system integrity.\n  \n•Provide advanced troubleshooting of server, operating system and application related issues.\n  \n•Assists Level 3, and guides Level 1 to perform detailed system design, configuration, implementation, documentation and support.\n  \n•Prioritize IT request and issues from conception through implementation.\n  \n•Participate in the server build, maintenance, and turndown process.\n  \n•Assist with the implementation of emerging technologies and systems.\n  \n•High interactions with other team members and business unit personnel.\n  \n•Participate in disaster recovery testing.\n  \nFamiliarize, gain experience, and comply with change control procedures.\n  \n\n  \nQualifications:\n  \n\n  \n•Associate’s Degree in Computer Science, Information Systems, or other related field is required.  Will accept professional experience in lieu of education.\n  \n•Minimum of four years’ experience with Microsoft Windows Operating Systems Installation and Configuration is required.\n  \n•Minimum of four years’ experience VMWare\/Virtualized Server maintenance is required.\n  \n•Minimum of two years’ experience of Remote Software Deployment and IT automation including scripting is required.\n  \n•Fundamental understanding of Active Directory is required.\n  \n•Fundamental knowledge of current Linux Operating Systems is preferred.\n  \n•Fundamental knowledge of networking protocols, especially TCP\/IP is preferred.\n  \n•Fundamental knowledge of Terminal Server, File\\\\Print Server, VPN Software, DNS, and DHCP is preferred.\n  \n•Fundamental understanding of infrastructure: including firewalls (local), databases, malware protection software and other processes is preferred.\n  \n•Fundamental understanding of security concepts preferred, in particular PII, PCI, SOX, and GLBA.\n  \n•Must have the ability to lift 25 pounds.\n  \n•Must have the ability to work independently with minimal supervision.\n  \n•Must be able to work in a team.\n  \n•Must possess a valid driver’s license.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday through Friday 8:15 AM to 4:30 PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Systems Administrator Level II","url":"http:\/\/dollarbankcareers.jobs\/39AD3CB9CC0E4269B7EF8B846A1BB89424","date_new":"2018-06-05 04:49:26","reqid":"2213BR","country_short":"USA","uid":null,"guid":"39AD3CB9CC0E4269B7EF8B846A1BB894","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Richmond Heights","description":"Dollar Bank is currently seeking a Branch Manager for its Richmond branch. The Branch Manager is responsible for the overall production of the branch, team development, and efficient daily operation of a full service office.\n  \n\n  \nQualifications:\n  \n\n  \n• Demonstrated ability to deliver outstanding customer service.\n  \n• Proficient computer skills, math aptitude and attention to detail is a must.\n  \n• Demonstrated strong leadership skills and dependability.\n  \n• Effectively communicate and demonstrate strong time management skills as required.\n  \n• Able to work well under pressure and be able to meet deadlines\n  \n• Minimum three years solid management experience in a retail environment is required, including managing a staff, coaching, and meeting goals. Banking environment desirable.\n  \n• Excellent demonstrable time management, communication and motivational skills are necessary.\n  \n• Bachelor’s degree required or commensurate experience.\n  \n• Must be willing to work a flexible schedule, including some evenings and Saturdays.\n  \n• A valid driver’s license and access to a reliable vehicle is required.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Consistently provide quality service as outlined in the Bank’s Quality Service Statement.\n  \n• Directly impact the growth and retention of customers through proactive efforts.  This can be accomplished by managing Online RB, ensuring their team is offering customers additional products and services, and holding regular monthly call nights to follow-up on any lists created by the Marketing Department, as well as, other sources of referrals from inside the branch.\n  \n• Focus on building a customer service driven team where everyone contributes to the success of the Relationship Building and Operational efforts.\n  \n• Develop and motivate the team members of their Office by offering constructive feedback and positive reinforcement. This can be accomplished at regular team meetings and through individual documented coaching sessions. Continue the development of the Operation and Relationship Manager’s leadership skills by offering constructive feedback and positive reinforcement through individual documented coaching sessions.\n  \n• Represent Dollar Bank in the community in a professional and competent manner at all times. Is expected to source business deposit and loan relationships within the surrounding communities through active participation in various organizations and charitable functions.\n  \n• Meet the established Group Banking Onsite Visit and Checking Accounts Opened goals each month. This will be accomplished by being proactive in outside calling efforts and by taking advantage all Group Banking opportunities within his market.\n  \n• Exhibit operational knowledge while upholding the operational integrity of the office by assisting the team in all areas of branch operations including Compliance.\n  \n• Achieve all Relationship Building, Operational Integrity, and Customer Service goals.\n  \n• Exercise sound decision-making skills as it relates to balancing risk, profitability, and customer service with every decision.\n  \n• Consistently lead by example, maintain professionalism and a positive attitude at all times and exercise superior leadership skills.\n  \n\n  \nPhysical Requirements and Working Conditions:\n  \nPerform sedentary to light work (able to lift up to 20 pounds from floor to waist, and\/or a negligible amount of force constantly to lift, carry, push, pull, grasp, or otherwise move objects). See, hear, talk and perform tasks requiring manual dexterity and visual acuity; sit, stand, walk, crouch,  reach, pull, push and other similar, repetitive tasks requiring physical activity. Able to operate standard office\/computer equipment such as photocopiers, fax machines, computers, iPads, scanners, calculators, etc.\n  \n**Address:**  5201 Wilson Mills Road\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Thursday 8:30am - 5:30pm\n  \nFriday: 8:30am-7:30pm\n  \nSaturday 8:30 am - 2:30 pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Branch Manager, Richmond","url":"http:\/\/dollarbankcareers.jobs\/AA78D4461A9049078218A5E41F290D3024","date_new":"2018-06-01 06:44:48","reqid":"2267BR","country_short":"USA","uid":null,"guid":"AA78D4461A9049078218A5E41F290D30","company":"Dollar Bank FSB","location":"Richmond Heights, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Pittsburgh","description":"DUTIES:\n  \n• Process transactions through the teller equipment on all retail and corporate accounts, including, but not limited to, deposits, withdrawals, transfers, loan payments, and cash advances.\n  \n• Issue money orders, cashier checks, gift cards, and savings bonds.\n  \n• Maintains cash flow and security drawers, terminals and other valuables.\n  \n• Maintain a professional appearance and conduct yourself in a professional manner at all times.\n  \n• Process transactions in an accurate and efficient manner while providing quality customer service.\n  \n• Develop a thorough knowledge of Bank products and guidelines by attending the required classes in DBU\n  \n• Meet established referral goals.\n  \n• Ability to manage a teller window while maintaining an acceptable balancing record and meeting the Bank’s standard of 30 transactions per hour.\n  \n\n  \nQUALIFICATIONS:\n  \n• High school diploma or GED required.\n  \n• Six months customer service and\/or cash handling experience required. Will also consider related experience such as accounts payable, bookkeeping, or budgeting. Previous teller experience preferred.\n  \n• Must be a team player, flexible and lead by example; must be a highly motivated self-starter.\n  \n• Excellent interpersonal skills and professional manner.\n  \n• Ability to lift a minimum of 3-5 pounds of heavy coin required.\n  \n• Ability to stand on feet for long periods of time required.\n  \n• Professional communication skills and appearance are required.\n  \n• Proficient computer skills and math aptitude required.\n  \n• May be required at times to adjust schedule availability based on branch needs.\n  \n• Must be available to attend scheduled training in the Strip District.\n  \n**Address:**  274 Yost Boulevard\n  \n**Employment Status:**  Part-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  This branch is open Monday through Friday 8:30 a.m. to 7:00 p.m. and Saturday 8:30 a.m. to 2:00 p.m.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Part-time Teller Trainee, Braddock Hills","url":"http:\/\/dollarbankcareers.jobs\/A1ACC529662445909A0E1F3F22C8FDF224","date_new":"2018-05-31 03:27:58","reqid":"2265BR","country_short":"USA","uid":null,"guid":"A1ACC529662445909A0E1F3F22C8FDF2","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Cleveland","description":"JOB FUNCTION \/ PURPOSE:\n  \n\n  \nWe are seeking a Customer Service Specialist to support our Eastern Cuyahoga and Lake County branches.  As a Customer Service Specialist, you will be responsible for identifying our customers’ financial needs by providing a thorough analysis and recommending the most appropriate Dollar Bank products and services to fulfill those needs. You will use your customer service experience, product knowledge and positive demeanor to initiate, expand and retain customer relationships through customer conversations and outbound calling. We are looking for flexible, enthusiastic, hardworking individuals with a sincere appreciation for people and an empathetic communication style to proactively contribute to the branch sales and service goals. Candidate will support multiple branch locations in a specified region.\n  \n\n  \nPRINCIPAL ACTIVITIES \/ OBJECTIVES:\n  \nIn a typical banking day you will enjoy a high level of customer contact. The primary focus of this role includes:\n  \n• Providing quality customer service in a positive, courteous and enthusiastic manner to all internal and external customers\n  \n• Contributing to the growth and retention of deposit and loan customers. Demonstrating a proactive sales approach to building customer relationships, effectively utilizing the customer conversations to promote Dollar Bank products and services and meeting the established Relationship Building goals set by your management team.\n  \n• Performing teller functions based upon the needs of the branch. Maintaining an acceptable balancing record while processing transactions in an accurate and efficient manner.\n  \n• Adhering to all established branch operational processes and procedures.\n  \nQUALIFICATIONS:\n  \nThe successful candidate will have the following qualifications:\n  \n\n  \n• High school diploma\/GED required.\n  \n• College degree required, or a minimum of 1 year demonstrated ability to deliver outstanding customer service in financial services or retail industry is required.\n  \n• Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n• Valid driver’s license and access to a reliable vehicle is required.\n  \n• Ability to work a flexible schedule including evenings and Saturdays.\n  \n• Ability to travel as needed to training and\/or multiple branch locations.\n  \n• Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \n\n  \nNOTE:\n  \n\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  1301 East 9th Street\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  Monday - Friday\n  \n8:30 AM - 7:30 PM\n  \n\n  \nSaturday\n  \n8:30 AM - 2:30 PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Customer Service Specialist, East Float","url":"http:\/\/dollarbankcareers.jobs\/67DBAEFAB28443428E2AB3478DFC34D224","date_new":"2018-05-31 03:27:57","reqid":"2254BR","country_short":"USA","uid":null,"guid":"67DBAEFAB28443428E2AB3478DFC34D2","company":"Dollar Bank FSB","location":"Cleveland, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Pittsburgh","description":"The Senior Commercial Real Estate Underwriter will be primarily responsible for analyzing and preparing credit proposals for new and existing commercial real estate relationships. The job function will also include the monitoring of Borrower’s financial performance to assist in the risk rating process. In addition, the Senior Commercial Real Estate Underwriter will assist in the preparation of monthly reports, perform ongoing portfolio analysis and complete other duties as assigned.\n  \n\n  \nQualifications:\n  \n\n  \n•  Bachelor’s degree in Accounting, Finance, Economics or related field, will consider commensurate experience.\n  \n•  Minimum 2 years work experience in analysis\/underwriting of commercial loans.\n  \n•  Excellent oral and written communication skills in addition to strong analytical, problem solving and organizational skills.\n  \n•  Ability to work on multiple projects simultaneously, independently and achieve required objectives with limited supervision.\n  \n•  Ability to work within a team environment, interacting with peers and management within the bank, as well as, with customers and outside support (appraisers, attorneys, accountants, etc.).\n  \n•  Experience with real estate software a plus.\n  \n•  Experience in an appraisal related field a plus.\n  \n•  PA Real Estate License a plus.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n•  Perform underwriting of new and existing commercial real estate loans to assess the financial condition, repayment capacity and risks associated with the transaction. To include analysis of real estate cash flow, global cash flows, personal cash flow and personal financial statements.\n  \n•  Review and analyze loan documents, leases, sales agreements, appraisals and other related materials. Effectively communicate results of the underwriting in a written loan presentation for review by lenders and senior management.\n  \n•  May participate in on-site client meetings.\n  \n•  Assure all analysis and underwriting conforms to credit policy, banking regulations and commercial real estate underwriting policies.\n  \n•  Research data to obtain information regarding current and projected status of certain industries, borrowers and market trends to assist in determining its impact on both the real estate and banking industry.\n  \n•  Prepare monthly credit and portfolio loan reports.\n  \n•  Mentor and assist in training of less experienced commercial real estate underwriters.\n  \n•  Perform additional assignments as requested.\n  \n**Address:**  Three Gateway Center\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8:45AM-4:45PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Sr. Commercial Real Estate Underwriter","url":"http:\/\/dollarbankcareers.jobs\/C379B893A6294843BBA2314021FCDC4224","date_new":"2018-05-30 05:36:45","reqid":"2217BR","country_short":"USA","uid":null,"guid":"C379B893A6294843BBA2314021FCDC42","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Canton","description":"JOB FUNCTION\/PURPOSE:\n  \n\n  \nThe Business Systems Analyst will work under the direction of the Manager of Retail Loan Servicing Control and will assist with the development, implementation, and deployment of new programs\/projects resulting from new product development, industry trends, banking regulations, etc. This may involve the review and evaluation of business systems and user needs.\n  \n\n  \nThe position is responsible for leading and\/or assisting with projects and executing the steps necessary to ensure the successful completion and implementation of assigned projects. The Business Systems Analyst will also provide on-going support and back-up to the operations analysts and management teams.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \n* Bachelors Degree in Business related field required\n  \n* Strong analytical and research skills are required, along with the ability to work with internal and external customers for timely and accurate resolutions to issues\n  \n* Must have excellent mathematical skills, including a sound knowledge of banking financial calculations (i.e. amortizations, interest rate and payment calculations, etc.)\n  \n* Working knowledge and understanding of retail loan principles and loan servicing experience is preferred\n  \n* Must be able to manage time efficiently and work independently with minimal supervision\n  \n* Must have excellent written and verbal communication skills\n  \n* Must have strong propensity for detail, accuracy, and confidentiality\n  \n* Must be professional and courteous with internal and external customers\n  \n* Must have intermediate to advanced knowledge of Microsoft Office including Word and Excel (testing will be administered)\n  \n* Overtime will be required, as needed\n  \n* Minimal travel is required\n  \n\n  \nPRINCIPAL ACTIVITIES\/OBJECTIVES:\n  \n\n  \n* Managing and supporting the development of new projects through special research, data analysis, and data collection\n  \n* Analyze, develop, implement, and deploy new programs\/projects resulting from new product development, regulations, etc.\n  \n* Develop and maintain project schedules, goals, and communications\n  \n* Develop and manage project documentation and reports\n  \n* Coordinate project tasks and progress with the project team, departments within the company, and outside entities, as applicable\n  \n* Arrange and\/or conduct testing needed to ensure the accurate and effective implementation of the project\n  \n* Maintain compliance with all federal, state, agency, and internal policies and procedures\n  \n\n  \nNote:\n  \n\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  City Center Tower\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday - Friday, 8:30 AM - 5:00 PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Project Analyst","url":"http:\/\/dollarbankcareers.jobs\/E2FE9FE1699E4214B6FE3F5F2B12FBB324","date_new":"2018-05-26 04:04:32","reqid":"2249BR","country_short":"USA","uid":null,"guid":"E2FE9FE1699E4214B6FE3F5F2B12FBB3","company":"Dollar Bank FSB","location":"Canton, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Cleveland","description":"Job Overview:\n  \n\n  \nThe VP, Real Estate Lending and Services is responsible for generating, underwriting and managing a medium size portfolio of commercial real estate loans. This individual will provide quality customer service and satisfaction while at the same time meeting a high level of credit quality consistent with the objectives of the Bank. This will be reflected in the accuracy, reliability, creativity, and consistency shown in analyzing, servicing and managing portfolios while effectively providing structural alternatives to customer loan requests.\n  \n\n  \nQualifications:\n  \n\n  \n• A Bachelor’s Degree in Business or a related field is required. Will consider commensurate experience. MBA preferred.\n  \n• Must have at least 5 years of experience in Commercial Real Estate Lending including negotiating loans, analyzing data, and providing exceptional customer service.\n  \n• Must have excellent math and analytical skills.\n  \n• Ability to make independent and sound decisions.\n  \n• Ability to work with and provide leadership to department employees.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Solicit and negotiate loan applications for commercial mortgage loans through owners and developers of commercial real estate and residential development.\n  \n• Obtain and analyze pertinent financial, credit and market data to determine the borrowers\/guarantors credit worthiness and recommend terms and conditions of loan structure for borrower.\n  \n• Perform site inspections of perspective property and market area to ensure stability and integrity of the property.\n  \n• Prepare loan presentations for all appropriate committee approvals, which includes working with loan analysts and underwriting.\n  \n• Ensure that appraisal, flood certifications and other required documents are ordered prior to funding.\n  \n• Work with outside legal counsel to complete the real estate closing process by ensuring the proper preparation of required legal documents. Participate in closings of loans to ensure bank’s approval is documented to the agreed upon structure of the loan.\n  \n• Manage, daily, all customer relationships assigned by Bank. Includes monitoring other Bank related services within these relationships.\n  \n• Read trade publications, business newspapers, and economic forecasts and participate in appropriate trade organizations in order to develop an awareness of economic activity, current events and local ongoing activities in the real estate industry. Evaluate this market information as to its impact on real estate and banking industry.\n  \n• Perform additional assignments as requested.\n  \n\n  \nPhysical Requirements and Working Conditions:\n  \nPerform sedentary to light work (able to lift up to 20 pounds from floor to waist, and\/or a negligible amount of force constantly to lift, carry, push, pull, grasp, or otherwise move objects). See, hear, talk and perform tasks requiring manual dexterity and visual acuity; sit, stand, walk, crouch,  reach, pull, push and other similar, repetitive tasks requiring physical activity. Able to operate standard office\/computer equipment such as photocopiers, fax machines, computers, iPads, scanners, calculators, etc.\n  \n\n  \nNote:\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  Tower at Erieview\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday: 8:30am - 5:30pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Vice President Lending, Commercial Real Estate","url":"http:\/\/dollarbankcareers.jobs\/7FAD353D634B4E51B17B6A59AD200D9A24","date_new":"2018-05-26 04:04:31","reqid":"2246BR","country_short":"USA","uid":null,"guid":"7FAD353D634B4E51B17B6A59AD200D9A","company":"Dollar Bank FSB","location":"Cleveland, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Bridgeville","description":"Tired of retail but love customer service and management? Join our team. We are looking for a Branch Manager for our South Fayette branch. An opportunity is available for an outgoing, articulate individual who can deliver quality customer service. As Branch Manager, you will be responsible for relationship building, employee hiring\/training\/development, quality performance and growth. Candidate must be a proactive, independent professional who is a motivated self-starter.\n  \n\n  \n•Minimum three years solid management experience in a retail environment is required, including managing a staff, coaching, and meeting goals. Banking environment desirable.\n  \n•Excellent demonstrable time management, communication and motivational skills are necessary.\n  \n•Bachelor's degree required or commensurate experience.\n  \n•Must be willing to work a flexible schedule, including some evenings and Saturdays.\n  \n•A valid driver’s license and access to a reliable vehicle is required.\n  \n**Address:**  160 Millers Run Road\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday - Thursday 9AM to 4:30PM and Friday 9AM to 6PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Branch Manager","url":"http:\/\/dollarbankcareers.jobs\/2F2E96EFB492454C9DF44E5F3A07698424","date_new":"2018-05-23 06:48:37","reqid":"2261BR","country_short":"USA","uid":null,"guid":"2F2E96EFB492454C9DF44E5F3A076984","company":"Dollar Bank FSB","location":"Bridgeville, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Pittsburgh","description":"This is a year round internship.\n  \n\n  \nThis internship is designed to give you real life work experience as a PC Support Technician.  You will work alongside experienced IT professionals.  You will:\n  \n\n  \nProvide first level technical support for back office users. First level technical support may include, but not be limited to, the following: utilizing windows deployment for workstations and installing the required software, installing workstations in the back office and branches, racking servers, moving computer equipment, performing routine hardware and software upgrades, and first level troubleshooting.\n  \n\n  \nReceive professional training and mentoring that will lead to transferable work experience.\n  \n\n  \nWork in a supportive, team oriented environment.\n  \n\n  \nQualifications:\n  \n\n  \n•Completion of 1 year of college\/technical school to include classes in Windows operating systems, PC repair, and networking.\n  \n\n  \n•A working knowledge of Ethernet, TCP\/IP, and Active Directory.\n  \n\n  \n•A strong commitment to customer service.\n  \n\n  \n•Occasional overtime may be necessary to accomplish group goals.\n  \n\n  \n•Good organizational skills and the ability to multi-task.\n  \n\n  \n•Ability to lift 25 pounds.\n  \n\n  \n•Ability to deal effectively with end-users, peers and managers in written as well as oral communications.\n  \n\n  \n•Willingness to accept duties as assigned.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Part-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  Monday through Friday, approximately 25-30 hours per week\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, pension, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, pension, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollarbank.com\/careers\/training_and_benefits.aspx .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"PC Support Intern","url":"http:\/\/dollarbankcareers.jobs\/C71CBF38657641F193ED42123C26BE4E24","date_new":"2018-05-22 03:56:00","reqid":"2245BR","country_short":"USA","uid":null,"guid":"C71CBF38657641F193ED42123C26BE4E","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Virginia Beach","description":"We are looking for enthusiastic, hardworking individuals with a sincere appreciation for people and an empathetic communication style that can assume a leadership role, motivate and hold accountable the team members of a branch to achieve all Relationship Building, Operational Integrity and Customer Service goals. As an Assistant Branch Manager, you will work with the Branch Manager in building a motivated, customer service focused team where everyone contributes to the success of the branch. You will lead the team by example and challenge them to exceed their expectations. This is a Management position where the incumbent will participate in a six to nine month comprehensive retail banking training program.\n  \n\n  \nQualifications:\n  \n\n  \n• Bachelor’s Degree required. Will consider commensurate experience.\n  \n• Retail Banking experience preferred.\n  \n• Managerial or Leadership experience is required.\n  \n• A minimum of one year of customer service experience, including demonstrated ability to achieve sales goals and deliver outstanding customer service is required.\n  \n• Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n• Ability to work a flexible schedule including evenings and Saturdays.\n  \n• Must have a valid driver’s license and access to a reliable vehicle.\n  \n• Ability to travel as needed to training.\n  \n• Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Directly impacting the growth and retention of deposit and loan customers. Leading the branch in fostering a proactive approach to building customer relationships while always maintaining the highest level of professionalism, integrity and ethics.\n  \n• Providing quality customer service and placing an emphasis on increasing the proactive sales and service efforts of team members through individual coaching sessions and team meetings. It is important that the Assistant Branch Manager create an enthusiastic, energetic and positive work environment for the team to flourish.\n  \n• Upholding the operational integrity of the branch by assisting the team in all areas of branch operations and demonstrating sound decision making skills as it relates to risk, profitability and customer service.\n  \n\n  \nPhysical Requirements and Working Conditions:\n  \nPerform sedentary to light work (able to lift up to 20 pounds from floor to waist, and\/or a negligible amount of force constantly to lift, carry, push, pull, grasp, or otherwise move objects). See, hear, talk and perform tasks requiring manual dexterity and visual acuity; sit, stand, walk, crouch, reach, pull, push and other similar, repetitive tasks requiring physical activity. Able to operate standard office\/computer equipment such as photocopiers, fax machines, computers, iPads, scanners, calculators, etc.\n  \n\n  \nNote:\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  998 Independence Blvd\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday - Thursday\n  \n8:45 AM - 5:30 PM\n  \nFriday\n  \n8:45 AM - 6:30 PM\n  \nSaturday\n  \n8:45 AM - 12:30 PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollarbank.com\/careers\/training_and_benefits.aspx .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Assistant Branch Manager","url":"http:\/\/dollarbankcareers.jobs\/3EEF5FB1F0DF471EA73CB81C77F16C4D24","date_new":"2018-05-18 05:47:55","reqid":"2252BR","country_short":"USA","uid":null,"guid":"3EEF5FB1F0DF471EA73CB81C77F16C4D","company":"Dollar Bank FSB","location":"Virginia Beach, VA","state":"Virginia","state_short":"VA"},{"country":"United States","city":"Pittsburgh","description":"JOB FUNCTION \/ PURPOSE:\n  \n\n  \nAs a Customer Service Specialist, you will be responsible for identifying our customers’ financial needs by providing a thorough analysis and recommending the most appropriate Dollar Bank products and services to fulfill those needs. You will use your customer service experience, product knowledge and positive demeanor to initiate, expand and retain customer relationships through customer conversations and outbound calling.  We are looking for flexible, enthusiastic, hardworking individuals with a sincere appreciation for people and an empathetic communication style to proactively contribute to the branch sales and service goals.\n  \n\n  \nPRINCIPAL ACTIVITIES \/ OBJECTIVES:\n  \n\n  \nIn a typical banking day you will enjoy a high level of customer contact.  The primary focus of this role includes:\n  \n• Providing quality customer service in a positive, courteous and enthusiastic manner to all internal and external customers\n  \n• Contributing to the growth and retention of deposit and loan customers. Demonstrating a proactive sales approach to building customer relationships, effectively utilizing the customer conversations to promote Dollar Bank products and services and meeting the established Relationship Building goals set by your management team.\n  \n• Performing teller functions based upon the needs of the branch. Maintaining an acceptable balancing record while processing transactions in an accurate and efficient manner.\n  \n• Adhering to all established branch operational processes and procedures.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \nThe successful candidate will have the following qualifications:\n  \n• High school diploma\/GED required.\n  \n• College degree required, or a minimum of 1 year demonstrated ability to deliver outstanding customer service in financial services or retail industry.\n  \n• Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n• Ability to work a flexible schedule including evenings and Saturdays.\n  \n• Ability to travel as needed to training.\n  \n• Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \n**Address:**  1850 Centre Avenue\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  This branch is open Tuesday through Friday 10:00 a.m. to 7:00 p.m. and Saturday and Sunday 10:00 a.m. to 3:00 p.m.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Customer Service Specialist, Hill District","url":"http:\/\/dollarbankcareers.jobs\/55C39B68ADFF4538A95E5838057FD08024","date_new":"2018-05-17 04:23:31","reqid":"2242BR","country_short":"USA","uid":null,"guid":"55C39B68ADFF4538A95E5838057FD080","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Eastlake","description":"Job Overview:\n  \n\n  \nAs a Senior Customer Service Specialist, you will be responsible for identifying our customers’ financial needs by providing a thorough analysis and recommending the most appropriate Dollar Bank products and services to fulfill those needs. You will use your customer service experience, product knowledge and positive demeanor to initiate, expand and retain customer relationships through customer conversations and outbound calling.  We are looking for flexible, enthusiastic, hardworking individuals with a sincere appreciation for people and an empathetic communication style to proactively contribute to the branch sales and service goals.\n  \n\n  \nQualifications:\n  \n\n  \n• High school diploma\/GED required.\n  \n• College degree required, or a minimum of 3 years demonstrated ability to deliver outstanding customer service in financial services or retail industry.\n  \n• A minimum of 2 years demonstrated track record of achieving sales goals is required.\n  \n• Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n• Ability to work a flexible schedule including evenings and Saturdays.\n  \n• Ability to travel as needed to training.\n  \n• Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Providing quality customer service in a positive, courteous and enthusiastic manner to all internal and external customers\n  \n• Contributing to the growth and retention of deposit and loan customers. Demonstrating a proactive sales approach to building customer relationships, effectively utilizing the customer conversations to promote Dollar Bank products and services and meeting the established Relationship Building goals set by your management team.\n  \n• Performing teller functions based upon the needs of the branch. Maintaining an acceptable balancing record while processing transactions in an accurate and efficient manner.\n  \n• Adhering to all established branch operational processes and procedures.\n  \nPhysical Requirements and Working Conditions:\n  \nPerform sedentary to light work (able to lift up to 20 pounds from floor to waist, and\/or a negligible amount of force constantly to lift, carry, push, pull, grasp, or otherwise move objects). See, hear, talk and perform tasks requiring manual dexterity and visual acuity; sit, stand, walk, crouch,  reach, pull, push and other similar, repetitive tasks requiring physical activity. Able to operate standard office\/computer equipment such as photocopiers, fax machines, computers, iPads, scanners, calculators, etc.\n  \n\n  \nNote:\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  34829 Vine Street\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  Monday-Friday: 8:30am - 7:30pm\n  \nSaturday: 8:30 am - 2:30 pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Senior Customer Service Specialist, Eastlake","url":"http:\/\/dollarbankcareers.jobs\/B632D3D5E6E94708AA7F60A510B72B2D24","date_new":"2018-05-16 06:38:52","reqid":"2239BR","country_short":"USA","uid":null,"guid":"B632D3D5E6E94708AA7F60A510B72B2D","company":"Dollar Bank FSB","location":"Eastlake, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Canton","description":"JOB FUNCTION\/PURPOSE:\n  \n\n  \nThe Loan Administrator’s job is to ensure all real estate secured loans have the escrow lines accurately set up for tax, hazard\/flood insurance, and PMI insurance. This includes obtaining the tax bills from the tax collector for payment, and the certification of payment on non-escrowed loans. This position is also responsible for ensuring all loans have sufficient hazard insurance to protect the collateral in the event of a loss. This includes payment of premiums on escrowed loans and confirmation of renewal coverage on non-escrowed loans.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \n*High School diploma or GED required\n  \n*Knowledge of loan documents preferred\n  \n*Knowledge of RESPA and CFPB regulations preferred\n  \n*1 year previous clerical type office experience  preferred\n  \n*Must be able to manage time efficiently, prioritize tasks, and meet deadlines\n  \n*Must have strong propensity for detail, accuracy, and work independently with minimal supervision in a team setting is required\n  \n*Must have excellent mathematical and analytical skills\n  \n*Must have excellent telephone, written, and verbal communication skills\n  \n*Must be professional and courteous with internal and external customers\n  \n*Working knowledge of Windows and Microsoft Office applications\n  \n*Must be able to type accurately 25 words per minute (will be tested)\n  \n\n  \nPRINCIPAL ACTIVITIES\/OBJECTIVES:\n  \n\n  \n*Maintain compliance with all federal, state agencies, and internal policies\/procedures\n  \n*Review tax\/insurance reports identifying items that need paid\/updated and generate those disbursements in a timely manner\n  \n*Use websites or make\/receive calls from tax authorities, insurance agents\/companies, or customers to obtain tax\/insurance premium amounts or certify proof of payment\n  \n*Process EDI hazard billings, insurance changes, and hazard cancellations\/reinstatements\n  \n*Set up tax, insurance, and pmi lines on new loans\n  \n*Research questions\/problems as requested from other departments\n  \n*Match the checks to the vouchers on tax\/hazard disbursements\n  \n*Cover and operate switchboard for incoming calls and transfer them to the appropriate person\n  \n*Open, identify, process daily tax\/insurance mail, faxes, and e-mails\n  \n*Send letters\/mortgagee clause  to tax authorities\/insurance companies\n  \n*Forward assessment notices from the taxing authority to customers\n  \n*File tax receipts\/insurance information\n  \n*Participate in and supply information requested for various audits\n  \n*Assist in special projects\n  \n\n  \nNote:\n  \n\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  City Center Tower\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  Monday - Friday\n  \n8:30 AM - 5:00 PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Entry-Level Loan Administrator","url":"http:\/\/dollarbankcareers.jobs\/1F22C0164DC1439BA0C7B587F1EF1D4E24","date_new":"2018-05-11 04:29:06","reqid":"2224BR","country_short":"USA","uid":null,"guid":"1F22C0164DC1439BA0C7B587F1EF1D4E","company":"Dollar Bank FSB","location":"Canton, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Pittsburgh","description":"DUTIES:\n  \n\n  \n• Process transactions through the teller equipment on all retail and corporate accounts, including, but not limited to, deposits, withdrawals, transfers, loan payments, and cash advances.\n  \n• Issue money orders, cashier checks, gift cards, and savings bonds.\n  \n• Maintains cash flow and security drawers, terminals and other valuables.\n  \n• Maintain a professional appearance and conduct yourself in a professional manner at all times.\n  \n• Process transactions in an accurate and efficient manner while providing quality customer service.\n  \n• Develop a thorough knowledge of Bank products and guidelines by attending the required classes in DBU.\n  \n• Meet established referral goals.\n  \n• Ability to manage a teller window while maintaining an acceptable balancing record and meeting the Bank’s standard of 30 transactions per hour.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \n• High school diploma or GED required.\n  \n• Six months customer service and\/or cash handling experience required. Will also consider related experience such as accounts payable, bookkeeping, or budgeting. Previous teller experience preferred.\n  \n• Must be a team player, flexible and lead by example; must be a highly motivated self-starter.\n  \n• Excellent interpersonal skills and professional manner.\n  \n• Ability to lift a minimum of 3-5 pounds of heavy coin required.\n  \n• Ability to stand on feet for long periods of time required.\n  \n• Professional communication skills and appearance are required.\n  \n• Proficient computer skills and math aptitude required.\n  \n• Must be available to attend scheduled training in the Strip District.\n  \n**Address:**  McIntyre Square\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  This branch is open Monday- Friday from 8:30am - 7:00pm, and Saturday 8:30am - 3:00pm.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \n\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit\n  \nhttp:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Full-time Teller Trainee, North Hills","url":"http:\/\/dollarbankcareers.jobs\/8907E228F26D4297B87698FD42E9E48B24","date_new":"2018-05-08 04:50:09","reqid":"2220BR","country_short":"USA","uid":null,"guid":"8907E228F26D4297B87698FD42E9E48B","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Pittsburgh","description":"Tired of retail but love customer service and management? Join our team. We are looking for a Branch Manager for our Oakland branch. An opportunity is available for an outgoing, articulate individual who can deliver quality customer service. As Branch Manager, you will be responsible for relationship building, employee hiring\/training\/development, quality performance and growth. Candidate must be a proactive, independent professional who is a motivated self-starter.\n  \n\n  \n•Minimum three years solid management experience in a retail environment is required, including managing a staff, coaching, and meeting goals. Banking environment desirable.\n  \n•Excellent demonstrable time management, communication and motivational skills are necessary.\n  \n•Bachelor's degree required or commensurate experience.\n  \n•Must be willing to work a flexible schedule, including some evenings and Saturdays.\n  \n•A valid driver’s license and access to a reliable vehicle is required.\n  \n**Address:**  Medical Arts Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday - Thursday 9AM to 4:30PM and Friday 9AM to 6PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Branch Manager","url":"http:\/\/dollarbankcareers.jobs\/E68A2833D5C94A8EBB0034F2147E8EF624","date_new":"2018-05-05 04:31:44","reqid":"2223BR","country_short":"USA","uid":null,"guid":"E68A2833D5C94A8EBB0034F2147E8EF6","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"McKeesport","description":"DUTIES:\n  \n\n  \n• Process transactions through the teller equipment on all retail and corporate accounts, including, but not limited to, deposits, withdrawals, transfers, loan payments, and cash advances.\n  \n• Issue money orders, cashier checks, gift cards, and savings bonds.\n  \n• Maintains cash flow and security drawers, terminals and other valuables.\n  \n• Maintain a professional appearance and conduct yourself in a professional manner at all times.\n  \n• Process transactions in an accurate and efficient manner while providing quality customer service.\n  \n• Develop a thorough knowledge of Bank products and guidelines by attending the required classes in DBU.\n  \n• Meet established referral goals.\n  \n• Ability to manage a teller window while maintaining an acceptable balancing record and meeting the Bank’s standard of 30 transactions per hour.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \n• High school diploma or GED required.\n  \n• Six months customer service and\/or cash handling experience required. Will also consider related experience such as accounts payable, bookkeeping, or budgeting. Previous teller experience preferred.\n  \n• Must be a team player, flexible and lead by example; must be a highly motivated self-starter.\n  \n• Excellent interpersonal skills and professional manner.\n  \n• Ability to lift a minimum of 3-5 pounds of heavy coin required.\n  \n• Ability to stand on feet for long periods of time required.\n  \n• Professional communication skills and appearance are required.\n  \n• Proficient computer skills and math aptitude required.\n  \n• Must be available to attend scheduled training in the Strip District.\n  \n**Address:**  400 Lysle Boulevard\n  \n**Employment Status:**  Part-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  This branch is open Monday-Thursday from 9:00 a.m.-4:00 p.m., Friday 9:00 a.m.-5:00 p.m. and closed Saturday.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Part-time Teller Trainee","url":"http:\/\/dollarbankcareers.jobs\/F6EDE129DAB24B4088CEE0D9AD3C310D24","date_new":"2018-05-05 04:31:44","reqid":"2232BR","country_short":"USA","uid":null,"guid":"F6EDE129DAB24B4088CEE0D9AD3C310D","company":"Dollar Bank FSB","location":"Mckeesport, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Virginia Beach","description":"We are seeking a Customer Service Specialist to support our branches in the Hampton Roads area. As a Customer Service Specialist, you will be responsible for identifying our customers’ financial needs by providing a thorough analysis and recommending the most appropriate Dollar Bank products and services to fulfill those needs. You will use your customer service experience, product knowledge and positive demeanor to initiate, expand and retain customer relationships through customer conversations and outbound calling. We are looking for flexible, enthusiastic, hardworking individuals with a sincere appreciation for people and an empathetic communication style to proactively contribute to the branch sales and service goals. Candidate will support multiple branch locations in a specified region.\n  \n\n  \nQualifications:\n  \n•High school diploma\/GED required.\n  \n•College degree required, or a minimum of 1 year demonstrated ability to deliver outstanding customer service in financial services or retail industry.\n  \n•Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n•Ability to work a flexible schedule including evenings and Saturdays.\n  \n•Ability to travel as needed to training.\n  \n•A valid driver’s license and access to a reliable vehicle is required.\n  \n•Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \n\n  \nPrinciple Activities and Duties:\n  \n•Providing quality customer service in a positive, courteous and enthusiastic manner to all internal and external customers\n  \n•Contributing to the growth and retention of deposit and loan customers. Demonstrating a proactive sales approach to building customer relationships, effectively utilizing the customer conversations to promote Dollar Bank products and services and meeting the established Relationship Building goals set by your management team.\n  \n•Performing teller functions based upon the needs of the branch. Maintaining an acceptable balancing record while processing transactions in an accurate and efficient manner.\n  \n•Adhering to all established branch operational processes and procedures.\n  \n**Address:**  501 S. Independence Blvd\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  Monday - Thursday\n  \n8:45 am - 5:15 pm\n  \n\n  \nFriday\n  \n8:45 am - 6:15 pm\n  \n\n  \nSaturday\n  \n8:45 am - 12:15 pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollarbank.com\/careers\/training_and_benefits.aspx .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Customer Service Specialist Float","url":"http:\/\/dollarbankcareers.jobs\/32B16D21093F4987AAD5A2151636A51024","date_new":"2018-04-28 03:55:02","reqid":"2208BR","country_short":"USA","uid":null,"guid":"32B16D21093F4987AAD5A2151636A510","company":"Dollar Bank FSB","location":"Virginia Beach, VA","state":"Virginia","state_short":"VA"},{"country":"United States","city":"Pittsburgh","description":"JOB FUNCTION \/ PURPOSE:\n  \n\n  \nAs a Customer Service Specialist, you will be responsible for identifying our customers’ financial needs by providing a thorough analysis and recommending the most appropriate Dollar Bank products and services to fulfill those needs. You will use your customer service experience, product knowledge and positive demeanor to initiate, expand and retain customer relationships through customer conversations and outbound calling.  We are looking for flexible, enthusiastic, hardworking individuals with a sincere appreciation for people and an empathetic communication style to proactively contribute to the branch sales and service goals.\n  \n\n  \nPRINCIPAL ACTIVITIES \/ OBJECTIVES:\n  \n\n  \nIn a typical banking day you will enjoy a high level of customer contact.  The primary focus of this role includes:\n  \n• Providing quality customer service in a positive, courteous and enthusiastic manner to all internal and external customers\n  \n• Contributing to the growth and retention of deposit and loan customers. Demonstrating a proactive sales approach to building customer relationships, effectively utilizing the customer conversations to promote Dollar Bank products and services and meeting the established Relationship Building goals set by your management team.\n  \n• Performing teller functions based upon the needs of the branch. Maintaining an acceptable balancing record while processing transactions in an accurate and efficient manner.\n  \n• Adhering to all established branch operational processes and procedures.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \nThe successful candidate will have the following qualifications:\n  \n• High school diploma\/GED required.\n  \n• College degree required, or a minimum of 1 year demonstrated ability to deliver outstanding customer service in financial services or retail industry.\n  \n• Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n• Ability to work a flexible schedule including evenings and Saturdays.\n  \n• Ability to travel as needed to training.\n  \n• Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \n**Address:**  Crafton-Ingram Shopping Center\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  This branch is open Monday-Wednesday 9:00 am-4:30 pm, Thursday 9:00 am-6:00 pm, Friday 9:00 am-7:00 pm, and Saturday 9:00 am-3:00 pm.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Customer Service Specialist, Crafton","url":"http:\/\/dollarbankcareers.jobs\/E4AB753208594421AB4737D03B474A7024","date_new":"2018-04-27 03:16:36","reqid":"2211BR","country_short":"USA","uid":null,"guid":"E4AB753208594421AB4737D03B474A70","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Brunswick","description":"Dollar Bank is currently seeking an enthusiastic, service professional that enjoys initiating conversations to build strong client relationships with customers. We are looking for flexible, enthusiastic, hardworking individuals with a sincere appreciation for people and an empathetic communication style to proactively contribute to the branch sales and service goals of its newest location coming soon to Brunswick.\n  \nQUALIFICATIONS:\n  \n\n  \n•High school diploma\/GED required.\n  \n•College degree required, or a minimum of 1 year demonstrated ability to deliver outstanding customer service in financial services or retail industry.\n  \n•Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n•Ability to work a flexible schedule including evenings and Saturdays.\n  \n•Ability to travel as needed to training.\n  \n•Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \n**Address:**  3630 Center Road\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  Monday-Thursday: 8:30am - 5:30pm\n  \nFriday: 8:30am - 7:30pm\n  \nSaturday: 8:30am - 2:30pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Customer Service Specialist, Brunswick","url":"http:\/\/dollarbankcareers.jobs\/435079D848314916BD6F4EA62D73348724","date_new":"2018-04-21 03:28:36","reqid":"2199BR","country_short":"USA","uid":null,"guid":"435079D848314916BD6F4EA62D733487","company":"Dollar Bank FSB","location":"Brunswick, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Virginia Beach","description":"Under the direction of the VP of Professional Development, the PD Specialist performs the general duties of coordinating core curriculum programs and delivering relevant material for instruction.  In addition, this position is responsible for demonstrating the Excellence of Dollar Banks Customer Service philosophy by participating in and practicing the disciplines and behaviors expected of an employee at the Bank.\n  \n\n  \nQUALIFICATIONS:\n  \n•Associates Degree in Education or related field required.  Will consider commensurate experience.\n  \n•Minimum 1 year of relevant work experience in training or educational processes to include design, delivery and   evaluation of core curriculum programs.\n  \n•Excellent facilitation\/presentation skills required.\n  \n•Experience as a back end user with Learning Management Systems and Computer Based Training preferred.\n  \n•Working knowledge with Powerpoint, Excel and Microsoft Word.\n  \n•Sales Training experience a plus.\n  \n•Excellent written and verbal communication skills.\n  \n•Project management, time management and superior organizational skills a must.\n  \n•Demonstrates critical thinking skills.\n  \n\n  \nPRINCIPAL ACTIVITIES \/ OBJECTIVES:\n  \nThe PD Specialist is expected to support and enhance Dollar Bank’s values and comply with Dollar Bank’s policies and procedures while instructing trainees and demonstrating the following duties:\n  \n•Provide quality customer service to all internal and external customers.\n  \n•Adhere to and teach the operational procedures that have been put in place by the bank.\n  \n•Provide input and evaluation on the design, development and delivery of entry level retail educational programs offered to new hires, regardless of position.\n  \n•Review entry level courses to ensure core curriculum programs are current and relevant.\n  \n•Develop and track training data for overall employee development programs.\n  \n•Consult with all management level personnel to identify, design, develop and\/or administer specialized training for current organizational trends\/needs.\n  \n•Manage, coordinate and deliver New Hire Orientation training where the culture is further identified and expectations are clearly explained.\n  \n•Works on developing advanced skills with intent of taking over teller training programs, projects and trainee’s.\n  \n•Develops basic understanding of each core program and is able to determine how all retail programs are related.\n  \n•Resolves routine questions and problems and refers more complex issues to management.\n  \n**Address:**  501 S. Independence Blvd\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Rotating Schedule\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollarbank.com\/careers\/training_and_benefits.aspx .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Professional Development Specialist","url":"http:\/\/dollarbankcareers.jobs\/42E71EE2452146488F3633377450D59924","date_new":"2018-04-20 04:48:49","reqid":"2191BR","country_short":"USA","uid":null,"guid":"42E71EE2452146488F3633377450D599","company":"Dollar Bank FSB","location":"Virginia Beach, VA","state":"Virginia","state_short":"VA"},{"country":"United States","city":"Pittsburgh","description":"Goal oriented and self motivated?  Take your successful sales experience and put it towards helping customers with their consumer loan needs.  The candidate will be responsible for originating and servicing new consumer loans (Home Equity, Auto, Personal, Credit Card) through a variety of means including networking, telemarketing and through participation in community events, and tradeshows.  The position will allow you to save customers money and help them reach their financial goals.\n  \n\n  \nThis candidate will:\n  \n\n  \n•Provide quality customer service to all internal and external customers.\n  \n•Originate and build consumer loan relationships with customers through proactive means including; telemarketing, community and networking opportunities, trade shows and through sourcing vendor\/referral source relationships in your direct market.\n  \n•Generate asset production results as well as related products and services by identifying and satisfying customer’s needs.\n  \n•Assist in the implementation of direct marketing programs in order to build consumer and business relationships within the community and loan center market in order to generate additional customer leads.\n  \n•Participate in yearly trade show events in order to generate additional consumer loan relationships for the Bank.\n  \n•Ensure that all operational policies and procedures are adhered to in accordance with Bank Policy and banking regulations.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \n•Must be a self starter, proactive professional\n  \n•Must have a minimum of one year sales and customer service experience with a demonstrated track record in building relationships through proactive means\n  \n•High school diploma\/GED required. College degree strongly preferred.\n  \n•Must possess excellent verbal and written communication skills\n  \n•Must be goal oriented and have the ability to strive to exceed expectations\n  \n•Must be available until 7pm on weekdays and on Saturdays\n  \n•Must have a valid Driver’s License and access to a vehicle.\n  \n**Address:**  1717 Cochran Road\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Candidate must be able to work a flexible schedule including some evenings and Saturdays.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Consumer Loan Representative","url":"http:\/\/dollarbankcareers.jobs\/B747C2F214B24BEC83AA85A691EE304924","date_new":"2018-04-14 04:21:19","reqid":"2168BR","country_short":"USA","uid":null,"guid":"B747C2F214B24BEC83AA85A691EE3049","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Pittsburgh","description":"Goal oriented and self motivated?  Take your successful sales experience and put it towards helping customers with their consumer loan needs.  The candidate will be responsible for originating and servicing new consumer loans (Home Equity, Auto, Personal, Credit Card) through a variety of means including networking, telemarketing and through participation in community events, and tradeshows.  The position will allow you to save customers money and help them reach their financial goals.\n  \n\n  \nThis candidate will:\n  \n\n  \n•Provide quality customer service to all internal and external customers.\n  \n•Originate and build consumer loan relationships with customers through proactive means including; telemarketing, community and networking opportunities, trade shows and through sourcing vendor\/referral source relationships in your direct market.\n  \n•Generate asset production results as well as related products and services by identifying and satisfying customer’s needs.\n  \n•Assist in the implementation of direct marketing programs in order to build consumer and business relationships within the community and loan center market in order to generate additional customer leads.\n  \n•Participate in yearly trade show events in order to generate additional consumer loan relationships for the Bank.\n  \n•Ensure that all operational policies and procedures are adhered to in accordance with Bank Policy and banking regulations.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \n•Must be a self starter, proactive professional\n  \n•Must have a minimum of one year sales and customer service experience with a demonstrated track record in building relationships through proactive means\n  \n•College degree strongly preferred.\n  \n•Must possess excellent verbal and written communication skills\n  \n•Must be goal oriented and have the ability to strive to exceed expectations\n  \n•Must be available until 7pm on weekdays and on Saturdays\n  \n•Must have a valid Driver’s License and access to a vehicle.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Candidate must be able to work a flexible schedule including some evenings and Saturdays.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Consumer Loan Representative","url":"http:\/\/dollarbankcareers.jobs\/BDCF10B90362400C85305D6E71A9793724","date_new":"2018-04-14 04:21:19","reqid":"2156BR","country_short":"USA","uid":null,"guid":"BDCF10B90362400C85305D6E71A97937","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Gibsonia","description":"We are looking for an experienced, enthusiastic, hardworking individual with a sincere appreciation for people and an empathetic communication style to proactively contribute to the branch sales and service goals. As a Senior Customer Service Specialist, you will contribute to the growth and retention of customers, identify our customers’ financial needs, and demonstrate a proactive sales approach to building relationships. You will use your customer service experience, product knowledge, and professional demeanor to meet the Relationship Building goals set by your management team.\n  \n\n  \nQualifications:\n  \n\n  \n• High school diploma\/GED required.\n  \n• College degree required, or a minimum of 3 years demonstrated ability to deliver outstanding customer service in financial services or retail industry.\n  \n• A minimum of 2 years demonstrated track record of achieving sales goals is required.\n  \n• Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n• Ability to work a flexible schedule including evenings and Saturdays.\n  \n• Ability to travel as needed to training.\n  \n• Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \n\n  \nDollar Bank is community-oriented and customer-focused in everything we do. We understand the importance of contributing to our local neighborhoods to help them grow and thrive. Any like-minded individuals would be assets to our team!\n  \n**Address:**  Richland Mall\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  This branch is open Monday- Thursday 9:00 a.m. - 6:00 p.m., Friday from 9:00 a.m.-7:00 p.m. and Saturday from 9:00 a.m.-2:00 p.m.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Senior Customer Service Specialist","url":"http:\/\/dollarbankcareers.jobs\/6678F9FB90F643BBA0FF005184689FE124","date_new":"2018-04-13 04:33:11","reqid":"2175BR","country_short":"USA","uid":null,"guid":"6678F9FB90F643BBA0FF005184689FE1","company":"Dollar Bank FSB","location":"Gibsonia, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Pittsburgh","description":"Job Overview:\n  \n\n  \nPrimarily responsible for managing, mentoring and training the team of the corporate underwriting staff and preparing credit proposals for new and existing corporate credit relationships.  This individual will collaborate with the Corporate Lending Officers on due diligence of credit requests, specifically for middle market clients.  In addition, the Manager will ensure the accuracy of management reports and compliance with regards to department and regulatory policies and practices.\n  \n\n  \nQualifications:\n  \n\n  \n• Bachelor’s degree in Business, preferably Accounting or Finance required. Will consider commensurate experience.\n  \n• Minimum of 10-years’ experience within a financial institution, performing credit risk analysis and corporate C & I underwriting including minimum 2 years of supervisory experience.\n  \n• Strong analytical and underwriting skills.\n  \n• Excellent oral and written communication skills.\n  \n• Strong organizational skills.\n  \n• Ability to self-start and work independently.\n  \n• Possess strong judgment and decision-making skills.\n  \n• Ability to work and manage within a team environment, interacting with reports, peers and senior management within the Bank as well as customers and outside third-party professionals.\n  \n• Knowledge of MS Suite of Products (Word, Excel, and Outlook) as well as minimum 2 years’ experience utilizing Moody’s Financial Analyst\/Risk Analyst or similar tools.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Review and evaluate all loan presentations prepared by the team of corporate underwriters.\n  \n• Assist and provide back-up support to the SVP Credit.\n  \n• Responsible for the preparation of quality, detailed financial analysis including cash flow models and collateral evaluations in order to identify potential credit risks.\n  \n• Capable of evaluating complex financial statements and analyze in order to prepare a credit review.\n  \n• Make recommendations in accordance with sound banking practices in order to minimize risk exposure.\n  \n• Ensure commercial loan requests adhere to bank policies and procedures.\n  \n• Effectively communicate and partner with the Corporate Lenders to assist with monitoring of the loan portfolio.\n  \n• May participate in off-site and on-site client meetings as required.\n  \n• Serve as a resource for credit questions from Corporate Lenders on new and existing commercial loan requests.\n  \n• Completion of special projects as required by senior management and other additional responsibilities as requested.\n  \n• Prepare loan presentations accurately and in a timely manner.\n  \n• Some contact with customers, conducting relationships in a professional manner that will enhance the overall marketing effort of the bank.\n  \n\n  \nSupervisory Responsibilities:\n  \n\n  \n• Supervise, provide support and training as well as prioritize and schedule work assignments for Corporate Underwriters.\n  \n• Prepares Corporate Underwriters’ annual reviews and recommends salary increases.\n  \n• Oversee the Corporate Underwriters’ workload, including monitoring work hours, vacation and personal days taken, to ensure timely turnaround time on loan presentations.\n  \n• Recommend growth enhancements such as internal or external training.\n  \n• Coaches Corporate Underwriters, monitors their actions, and holds them accountable.\n  \n• Prepares job descriptions for Corporate Underwriters.\n  \n• Oversees the hiring process of Corporate Underwriters.\n  \n**Address:**  Three Gateway Center\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8:45AM-5:00PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"VP, Corporate Underwriting Manager","url":"http:\/\/dollarbankcareers.jobs\/7768F997831943B8A086C08748ED944624","date_new":"2018-04-12 04:59:27","reqid":"2195BR","country_short":"USA","uid":null,"guid":"7768F997831943B8A086C08748ED9446","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Pittsburgh","description":"Job Overview:\n  \n\n  \nResponsible for overall coordination, status reporting and stability of project oriented work efforts. Manages projects from initiation through implementation and post-implementation assessment. Adheres to project management processes and methodologies to ensure projects are delivered on time and within budget. Responsible for assembling project management deliverables, directing and monitoring work efforts, identifying resource needs, performing quality review, and escalating functional, quality, timeline, financial issues appropriately.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Manages all assigned projects to completion, ensuring on-time delivery, tracking budget activity, and maintenance of overall project ownership.\n  \n• Develops, maintains, and manages project deliverables required within the Software Development Lifecycle.\n  \n• Manages a cross-functional deployment team including internal and third party resources when necessary; coordinates and tracks activities amongst all to achieve goals.\n  \n• Coordinates and facilitates project meetings.\n  \n• Maintains communication with all project stakeholders.\n  \n• Addresses problems through risk management and contingency planning and presents solutions and\/or options to executive management.\n  \n• Mentors other Project Managers.\n  \n• Monitors effectiveness of project management processes and methodologies; recommends improvements as necessary.\n  \n\n  \nQualifications:\n  \n\n  \n• Bachelor’s Degree in Information Technology or related field required. Will consider commensurate experience.\n  \n• Minimum 8 years’ of experience in a project management role\n  \n• Demonstrated leadership skills\n  \n• Strong organizational and analytical skills\n  \n• Excellent verbal and written communication skills\n  \n• Formal Project Management training and\/or certification\n  \n• Experience with Project Management tools\n  \n• Demonstrated experience managing projects large in size and scope\n  \n• Able to manage simultaneous projects.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8AM-4:15PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"AVP, Project Manager","url":"http:\/\/dollarbankcareers.jobs\/F56D0FA64E2F4892B30A9C072239671624","date_new":"2018-04-10 07:12:57","reqid":"2169BR","country_short":"USA","uid":null,"guid":"F56D0FA64E2F4892B30A9C0722396716","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Pittsburgh","description":"Job Overview:\n  \n\n  \nThe purpose of this position is to support the functions of the branches and back office departments; to install, configure and support MPLS\/Frame Relay environment as well as routers\/switches, firewalls and the legacy and LAN multi-protocols associated with this technology; to work with internal departments to troubleshoot connectivity\/networking problems; to work with outside vendors on installations and troubleshooting of problems related to network connectivity and software configuration; to respond to security updates related to network equipment and make required changes to maintain network security; to troubleshoot problems using appropriate network management tools; to configure and administrate network management tools; to administrate department servers running Windows and\/or Unix; to administrate Video Conferencing system; to install, configure and support VPN appliance.\n  \n\n  \nQualifications:\n  \n\n  \n• Minimum of 2 years’ experience in Teleprocessing environment including technical experience with voice\/data networks and systems.\n  \n• Associate’s Degree in Information Technology or related field required. Will consider commensurate experience.\n  \n• Able to communicate effectively with all levels of management and outside vendors.\n  \n• Able to work periodic evenings and weekends.\n  \n• Must have good documentation and analytical skills.\n  \n• Should have a good working knowledge of installing and maintaining telecommunications cable plants.\n  \n• Experience with a variety of computer platforms ranging from mainframe (CICS and VTAM) to PC based applications preferred.\n  \n• Experience with a variety of networking protocols including TCP\/IP, EIGRP, BGP and SSH.\n  \n• Knowledge of the Windows implementations of DHCP, DNS and Active Directory.\n  \n• Knowledge of Linux, Unix, Microsoft and Pearl shell batch scripting preferred.\n  \n• A vehicle and valid PA driver’s license required.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Recommend and purchase new network equipment.\n  \n• Recommend and install applications that will assist monitoring of the network.\n  \n• Install, configure and support data equipment\/networks at branch offices and back office departments.\n  \n• Respond to all network security alerts. Including IOS upgrades and installing security patches.\n  \n• Make necessary firewall changes to segregate departments and provide\/restrict external access to internal systems.\n  \n• Assign and maintain IP addressing scheme for the entire network.\n  \n• Make configuration changes to allow support departments to have VPN access.\n  \n• Troubleshoot network connectivity problems.\n  \n• Administrate departmental servers.\n  \n• Make technical presentations to upper management related to networking projects.\n  \n• Configure network equipment and troubleshoot network issues for annual Disaster Recovery test.\n  \n**Address:**  Liberty Commons Building\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8AM - 4PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Network Analyst","url":"http:\/\/dollarbankcareers.jobs\/3DA91C8D75FF4859839125E6CC5CAE7124","date_new":"2018-04-07 07:22:04","reqid":"2075BR","country_short":"USA","uid":null,"guid":"3DA91C8D75FF4859839125E6CC5CAE71","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Cleveland","description":"The Senior Business Banking Underwriter is responsible for underwriting all new loan \/ lease applications and renewal applications. The individual will work with Senior Business Banking Representatives and Portfolio Managers and their customers regarding underwriting issues. The individual will also work with Portfolio Managers on SBA Loan Packages and loan renewals. The Senior Business Banking Underwriter will also prepare all loan \/ lease credit proposals.\n  \n\n  \nQualifications:\n  \n\n  \n• Bachelor’s Degree required preferably in Finance or Accounting.  Will consider commensurate experience.\n  \n• Must have 1-2 years’ experience in commercial underwriting.\n  \n• Ability to prioritize; work under pressure and meet deadlines.\n  \n• Ability to handle several different tasks at one time.\n  \n• Very organized and detail oriented.\n  \n• Strong written and verbal communication skills.\n  \n• Solid analytical and quantitative skills.  Ability to analyze reports to draw accurate conclusions from data.\n  \n• Must be proficient in Microsoft Excel (candidate will be tested).\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Complete collateral analysis to verify it will support the loan \/ lease request.\n  \n• Review all credit information and financial statement spreads.\n  \n• Prepare approval worksheets and\/or credit proposals and obtain required signatures for approval.\n  \n• Communicates and properly documents credit decisions.\n  \n• Review completed loan \/ lease packages prior to funding.\n  \n• Conducts final review of lease worksheets.\n  \n• Assists on special assignments and projects\n  \n\n  \nPhysical Requirements and Working Conditions:\n  \nPerform sedentary to light work (able to lift up to 20 pounds from floor to waist, and\/or a negligible amount of force constantly to lift, carry, push, pull, grasp, or otherwise move objects). See, hear, talk and perform tasks requiring manual dexterity and visual acuity; sit, stand, walk, crouch,  reach, pull, push and other similar, repetitive tasks requiring physical activity. Able to operate standard office\/computer equipment such as photocopiers, fax machines, computers, iPads, scanners, calculators, etc.\n  \n\n  \nNote:\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  Tower at Erieview\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday through Friday:\n  \n8:30AM-5:30PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Senior Business Banking Underwriter","url":"http:\/\/dollarbankcareers.jobs\/72AB23BCF2D44D08852AFF72C1C77E1E24","date_new":"2018-04-06 05:20:13","reqid":"2171BR","country_short":"USA","uid":null,"guid":"72AB23BCF2D44D08852AFF72C1C77E1E","company":"Dollar Bank FSB","location":"Cleveland, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Virginia Beach","description":"In this position, the VP, Business Banking individual has a high degree of independent authority to employ the Banks’ assets, using direction and judgment to administer commercial liabilities, to implement policies and procedures and have a major impact on Bank profitability. The VP, Business Banking interacts and works with individuals in the Retail Banking Centers, Private Banking, Corporate Banking, Commercial Real Estate, Treasury Management, and the Credit Department. The VP, Business Banking individual must understand and be able to offer all products and services of the Bank with special emphasis on business loan and deposit products. This individual is expected to provide a high level of service to existing customers and perform business prospecting activities. In addition, this individual may be called upon to help manage and coach less experienced Business Banking Representatives, Business Banking Officers, and AVP, Business Banking employees to further develop their skills and career within the Bank.\n  \n\n  \nQualifications:\n  \n•Ability to prioritize; work under pressure and meet deadlines.\n  \n•Bachelor’s degree required. Will consider commensurate experience.\n  \n•Ability to multi-task.\n  \n•Minimum of five years of experience in working with business owners in developing solutions to their financial service needs required.\n  \n•Knowledge of all business credit deposit products and services, with special emphasis on business credit and deposit products and services.\n  \n•Knowledge of national and regional government assisted loan programs.\n  \n•Strong written and oral communication skills required to interpret and explain financial data to others involved in the loan approval process.\n  \n•Demonstrated abilities and desire to provide high quality customer service.\n  \n•Demonstrated skills in performing and understanding financial ratios, collateral coverage, and cash flow analysis for business borrowers.\n  \n•Demonstrated sales and business development skills and achievements.\n  \n•Must have a valid drivers’ license and access to a dependable vehicle for business development opportunities.\n  \n•Working knowledge of Windows, Microsoft Word and Excel.\n  \n\n  \nPrinciple Activities and Duties:\n  \n•Establish an annual business development plan and goals with the objective of fostering Bank growth through mutually beneficial account relationships.\n  \n•Develop and maintain business relationships through a sales oriented calling program.\n  \n•Complete call reports on all business visits, outlining the purpose of the call, business needs, financial information, and future focus for the business.\n  \n•Participate in community and civic functions, either in an advisory or active capacity, representing Dollar Bank, with emphasis on maintaining and developing business relationships.\n  \n•Manage and\/or participate in any special assignments as requested by the Vice President & Manager of Business Banking.\n  \n•Assist with the development of less experienced Business Banking Representatives.\n  \n•Make Credit Proposal presentations to Credit Committee, when required.\n  \n**Address:**  501 S. Independence Blvd\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Candidate will be required to work a flexible schedule with base hours of Monday through Friday 8:30 am to 5:30 pm.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollarbank.com\/careers\/training_and_benefits.aspx .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"VP Business Banking","url":"http:\/\/dollarbankcareers.jobs\/6CF9BC0CB18F4D919AB38B57D2E9BABA24","date_new":"2018-04-03 03:57:48","reqid":"2161BR","country_short":"USA","uid":null,"guid":"6CF9BC0CB18F4D919AB38B57D2E9BABA","company":"Dollar Bank FSB","location":"Virginia Beach, VA","state":"Virginia","state_short":"VA"},{"country":"United States","city":"Canton","description":"JOB FUNCTION\/PURPOSE –\n  \n\n  \nThe Customer Relations Department is responsible for ensuring a positive, memorable customer experience to all customers as the point of contact and continuing throughout the follow-up and resolution processes. Customer Relations Specialist promptly and courteously answers all incoming phone calls. Specialists resolve customer complaints by listening to determine the cause of the problem; select and explain the best solution to solve the issue; follow-up to ensure resolution and customer satisfaction.  Specialists complete and review daily, weekly, and monthly reports ensure completion of tasks and maintain regulatory compliance.\n  \n\n  \nQualifications:\n  \n\n  \n*High School diploma or GED required; college degree preferred in a business related field\n  \n*Minimum of 1 year previous Customer Service experience required\n  \n*1 year Mortgage Servicing or Banking experience preferred\n  \n*Knowledge of loan documents preferred\n  \n*Must be able to manage time efficiently, prioritize tasks, and coordinate multiple and changing priorities in a demanding environment\n  \n*Ability to work independently with minimal supervision in a team setting is required\n  \n*Must have excellent telephone, written, and verbal communication skills\n  \n*Must have a sense of urgency in providing knowledgeable and prompt assistance to customers\n  \n*Must have strong propensity for detail, accuracy, and confidentiality\n  \n*Must have excellent mathematical, analytical and problem solving skills\n  \n*Must be professional and courteous with internal and external customers\n  \n*Must be able to remain calm under pressure\n  \n*Working knowledge of Windows and Microsoft Office applications\n  \n*Must be able to type accurately at 25-30 wpm\n  \n\n  \nPRINCIPAL ACTIVITIES\/OBJECTIVES:\n  \n\n  \n~Specialists receive, assign and process daily mail.\n  \n~Thoroughly review, follow-up, notate, and respond to customer inquiries in a timely and accurate manner within compliance and investor guidelines.\n  \n~Ensure adequate phone coverage in the department at all times.\n  \n~Comply with bank, regulatory and investor requirements regarding all functions of the Customer Relations Department.\n  \n~The Specialists reports to the Customer Relations Manager and may be expected to assist other Customer Relations Specialists, management, and\/or other departments on a regular basis.\n  \n~Review, interpret and understand a loan payment history, to explain to a customer or review for issues.\n  \n~Review and complete request for customers, including but not limited to PMI\/MIP deletions, escrow deletions, interest calculations, and escrow analysis.\n  \n\n  \nNote:\n  \n\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  City Center Tower\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  8:30am to 5:00pm Monday through Friday\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit http:\/\/www.dollarbank.com\/careers\/training_and_benefits.aspx.\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \nMinority\/Female\/Veteran\/Disabled","title":"Customer Support - Call Center","url":"http:\/\/dollarbankcareers.jobs\/60F48AA0040B4588BA67593801B2888524","date_new":"2018-03-29 04:57:31","reqid":"2128BR","country_short":"USA","uid":null,"guid":"60F48AA0040B4588BA67593801B28885","company":"Dollar Bank FSB","location":"Canton, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Pittsburgh","description":"DUTIES:\n  \n\n  \n• Process transactions through the teller equipment on all retail and corporate accounts, including, but not limited to, deposits, withdrawals, transfers, loan payments, and cash advances.\n  \n• Issue money orders, cashier checks, gift cards, and savings bonds.\n  \n• Maintains cash flow and security drawers, terminals and other valuables.\n  \n• Maintain a professional appearance and conduct yourself in a professional manner at all times.\n  \n• Process transactions in an accurate and efficient manner while providing quality customer service.\n  \n• Develop a thorough knowledge of Bank products and guidelines by attending the required classes in DBU.\n  \n• Meet established referral goals.\n  \n• Ability to manage a teller window while maintaining an acceptable balancing record and meeting the Bank’s standard of 30 transactions per hour.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \n• High school diploma or GED required.\n  \n• Six months customer service and\/or cash handling experience required. Will also consider related experience such as accounts payable, bookkeeping, or budgeting. Previous teller experience preferred.\n  \n• Must be a team player, flexible and lead by example; must be a highly motivated self-starter.\n  \n• Excellent interpersonal skills and professional manner.\n  \n• Ability to lift a minimum of 3-5 pounds of heavy coin required.\n  \n• Ability to stand on feet for long periods of time required.\n  \n• Professional communication skills and appearance are required.\n  \n• Proficient computer skills and math aptitude required.\n  \n• Must be available to attend scheduled training in the Strip District.\n  \n**Address:**  Waterworks Mall\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  This branch is open Monday- Friday from 8:30am - 7:00pm, and Saturday 8:30am - 2:00pm.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \n\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit\n  \nhttp:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Full-time Teller Trainee, Fox Chapel","url":"http:\/\/dollarbankcareers.jobs\/9B80A20B3188433399B827F6F800400224","date_new":"2018-03-29 04:57:31","reqid":"2141BR","country_short":"USA","uid":null,"guid":"9B80A20B3188433399B827F6F8004002","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Cleveland","description":"Dollar Bank is currently seeking a Business Banking Lender to service the Northeastern Ohio area.\n  \n\n  \nIn this position, the AVP, Business Banking individual has a high degree of independent authority to employ the Banks’ assets, using direction and judgment to administer commercial liabilities, to implement policies and procedures and have a major impact on Bank profitability.  The AVP, Business Banking individual interacts and works with individuals in the Retail Banking Centers, Private Banking, Corporate Banking, Commercial Real Estate, Treasury Management, and the Credit Department.  The AVP, Business Banking individual must understand and be able to offer all products and services of the Bank with special emphasis on business loan and deposit products.  This individual is expected to provide a high level of service to existing customers and perform business prospecting activities.\n  \n\n  \nQualifications:\n  \n\n  \n• Bachelor’s degree required. Will consider commensurate experience.\n  \n• Ability to prioritize; work under pressure and meet deadlines.\n  \n• Ability to handle several different tasks at one time.\n  \n• Minimum of six years of experience in working with business owners in developing solutions to their financial service needs\n  \n• Knowledge of all business credit deposit products and services.\n  \n• Knowledge of national and regional government assisted loan programs.\n  \n• Strong written and oral communication skills required to interpret and explain financial data to others involved in the loan approval process.\n  \n• Demonstrated abilities and desire to provide high quality customer service.\n  \n• Demonstrated skills in performing and understanding financial ratios, collateral coverage, and cash flow analysis for business borrowers.\n  \n• Demonstrated sales and business development skills and achievements.\n  \n• Must have a valid drivers’ license and access to a dependable vehicle for business development opportunities.\n  \n• Working knowledge of Windows, Microsoft Word and Excel.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Establish an annual business development plan and goals with the objective of fostering Bank growth through mutually beneficial account relationships.\n  \n• Develop and maintain business relationships through a sales oriented calling program.\n  \n• Complete call reports on all business visits, outlining the purpose of the call, business needs, financial information, and future focus for the business.\n  \n• Participate in community and civic functions, either in an advisory or active capacity, representing Dollar Bank, with emphasis on maintaining and developing business relationships.\n  \n• Manage and\/or participate in any special assignments as requested by the Vice President of Business Banking.\n  \n• Assist with the development of less experienced Business Banking Representatives.\n  \n\n  \nPhysical Requirements and Working Conditions:\n  \nPerform sedentary to light work (able to lift up to 20 pounds from floor to waist, and\/or a negligible amount of force constantly to lift, carry, push, pull, grasp, or otherwise move objects). See, hear, talk and perform tasks requiring manual dexterity and visual acuity; sit, stand, walk, crouch,  reach, pull, push and other similar, repetitive tasks requiring physical activity. Able to operate standard office\/computer equipment such as photocopiers, fax machines, computers, iPads, scanners, calculators, etc.\n  \n**Address:**  Tower at Erieview\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday through Saturday 8:30am to 5:30pm.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"AVP Business Banking","url":"http:\/\/dollarbankcareers.jobs\/8880738B0B9E46409994AE65D5D5929A24","date_new":"2018-03-13 04:51:14","reqid":"2082BR","country_short":"USA","uid":null,"guid":"8880738B0B9E46409994AE65D5D5929A","company":"Dollar Bank FSB","location":"Cleveland, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Euclid","description":"Dollar Bank is currently seeking a Branch Manager for its Euclid branch. The Branch Manager is responsible for the overall production of the branch, team development, and efficient daily operation of a full service office.\n  \n\n  \nQualifications:\n  \n\n  \n• Demonstrated ability to deliver outstanding customer service.\n  \n• Proficient computer skills, math aptitude and attention to detail is a must.\n  \n• Demonstrated strong leadership skills and dependability.\n  \n• Effectively communicate and demonstrate strong time management skills as required.\n  \n• Able to work well under pressure and be able to meet deadlines\n  \n• Minimum three years solid management experience in a retail environment is required, including managing a staff, coaching, and meeting goals. Banking environment desirable.\n  \n• Excellent demonstrable time management, communication and motivational skills are necessary.\n  \n• Bachelor’s degree required or commensurate experience.\n  \n• Must be willing to work a flexible schedule, including some evenings and Saturdays.\n  \n• A valid driver’s license and access to a reliable vehicle is required.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Consistently provide quality service as outlined in the Bank’s Quality Service Statement.\n  \n• Directly impact the growth and retention of customers through proactive efforts.  This can be accomplished by managing Online RB, ensuring their team is offering customers additional products and services, and holding regular monthly call nights to follow-up on any lists created by the Marketing Department, as well as, other sources of referrals from inside the branch.\n  \n• Focus on building a customer service driven team where everyone contributes to the success of the Relationship Building and Operational efforts.\n  \n• Develop and motivate the team members of their Office by offering constructive feedback and positive reinforcement. This can be accomplished at regular team meetings and through individual documented coaching sessions. Continue the development of the Operation and Relationship Manager’s leadership skills by offering constructive feedback and positive reinforcement through individual documented coaching sessions.\n  \n• Represent Dollar Bank in the community in a professional and competent manner at all times. Is expected to source business deposit and loan relationships within the surrounding communities through active participation in various organizations and charitable functions.\n  \n• Meet the established Group Banking Onsite Visit and Checking Accounts Opened goals each month. This will be accomplished by being proactive in outside calling efforts and by taking advantage all Group Banking opportunities within his market.\n  \n• Exhibit operational knowledge while upholding the operational integrity of the office by assisting the team in all areas of branch operations including Compliance.\n  \n• Achieve all Relationship Building, Operational Integrity, and Customer Service goals.\n  \n• Exercise sound decision-making skills as it relates to balancing risk, profitability, and customer service with every decision.\n  \n• Consistently lead by example, maintain professionalism and a positive attitude at all times and exercise superior leadership skills.\n  \n\n  \nPhysical Requirements and Working Conditions:\n  \nPerform sedentary to light work (able to lift up to 20 pounds from floor to waist, and\/or a negligible amount of force constantly to lift, carry, push, pull, grasp, or otherwise move objects). See, hear, talk and perform tasks requiring manual dexterity and visual acuity; sit, stand, walk, crouch,  reach, pull, push and other similar, repetitive tasks requiring physical activity. Able to operate standard office\/computer equipment such as photocopiers, fax machines, computers, iPads, scanners, calculators, etc.\n  \n**Address:**  240 East 228\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Thursday 8:30am - 5:30pm\n  \nFriday: 8:30am-7:30pm\n  \nSaturday 8:30 am - 2:30 pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Branch Manager, Euclid","url":"http:\/\/dollarbankcareers.jobs\/359F6B22A00F4D6ABDB7CAA63ABE1BC924","date_new":"2018-03-10 05:47:02","reqid":"2124BR","country_short":"USA","uid":null,"guid":"359F6B22A00F4D6ABDB7CAA63ABE1BC9","company":"Dollar Bank FSB","location":"Euclid, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Pittsburgh","description":"JOB FUNCTION \/ PURPOSE:\n  \n\n  \nAs a Customer Service Specialist, you will be responsible for identifying our customers’ financial needs by providing a thorough analysis and recommending the most appropriate Dollar Bank products and services to fulfill those needs. You will use your customer service experience, product knowledge and positive demeanor to initiate, expand and retain customer relationships through customer conversations and outbound calling.  We are looking for flexible, enthusiastic, hardworking individuals with a sincere appreciation for people and an empathetic communication style to proactively contribute to the branch sales and service goals.\n  \n\n  \nPRINCIPAL ACTIVITIES \/ OBJECTIVES:\n  \n\n  \nIn a typical banking day you will enjoy a high level of customer contact.  The primary focus of this role includes:\n  \n• Providing quality customer service in a positive, courteous and enthusiastic manner to all internal and external customers\n  \n• Contributing to the growth and retention of deposit and loan customers. Demonstrating a proactive sales approach to building customer relationships, effectively utilizing the customer conversations to promote Dollar Bank products and services and meeting the established Relationship Building goals set by your management team.\n  \n• Performing teller functions based upon the needs of the branch. Maintaining an acceptable balancing record while processing transactions in an accurate and efficient manner.\n  \n• Adhering to all established branch operational processes and procedures.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \nThe successful candidate will have the following qualifications:\n  \n• High school diploma\/GED required.\n  \n• College degree required, or a minimum of 1 year demonstrated ability to deliver outstanding customer service in financial services or retail industry.\n  \n• Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n• Ability to work a flexible schedule including evenings and Saturdays.\n  \n• Ability to travel as needed to training.\n  \n• Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \n**Address:**  5822 Forbes Avenue\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  This branch is open Monday, Tuesday, Wednesday, and Friday from 9:00 a.m. to 4:00 p.m., Thursday from 9:00 a.m. to 6:30 p.m., and Saturday from 9:00 a.m. to 2:00 p.m.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Customer Service Specialist, Squirrel Hill","url":"http:\/\/dollarbankcareers.jobs\/AEF45B3CB3BA4FCAA6364AFF9026D67724","date_new":"2018-03-02 04:02:32","reqid":"2093BR","country_short":"USA","uid":null,"guid":"AEF45B3CB3BA4FCAA6364AFF9026D677","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Middleburg Heights","description":"Job Overview:\n  \n\n  \nThe Senior Mortgage Representative is responsible for originating quality saleable mortgage loan applications from assigned Dollar Bank branches and various referral sources including, Realtors, financial planners, attorneys, and other professional contacts.\n  \n\n  \nQualifications:\n  \n\n  \n• High School Diploma\/GED required. College Degree preferred.\n  \n• Minimum of 3 years of originating mortgage loan applications experience required.\n  \n• Excellent communication and organizational skills.\n  \n• Knowledge of Freddie Mac, Fannie Mae, FHA and VA underwriting guidelines.\n  \n• Software knowledge including; Point of sale first mortgage loan origination system, Microsoft Word and Excel.\n  \n• General business, financial and credit lending knowledge.\n  \n• Valid driver’s license and reliable vehicle.\n  \n• NMLS Registration.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Enter all data required to complete a residential mortgage application in the loan origination system.\n  \n• Provide buyer with all required early disclosures.\n  \n• Assist borrowers by explaining lending programs and all required information needed to complete the mortgage process.\n  \n• Properly quote interest rates for loan programs offered and lock-in the interest rate at the time of the borrower’s request.\n  \n• Achieve assigned production goals.\n  \n• Actively network with Realtors and other professional referral sources. Attend networking functions and trade shows as determined by management.\n  \n• Oversee active pipeline of mortgages from application to closing and work closely with the operations personnel to assist in processing the application when needed.\n  \n\n  \nPhysical Requirements and Working Conditions:\n  \nPerform sedentary to light work (able to lift up to 20 pounds from floor to waist, and\/or a negligible amount of force constantly to lift, carry, push, pull, grasp, or otherwise move objects). See, hear, talk and perform tasks requiring manual dexterity and visual acuity; sit, stand, walk, crouch, reach, pull, push and other similar, repetitive tasks requiring physical activity. Able to operate standard office\/computer equipment such as photocopiers, fax machines, computers, iPads, scanners, calculators, etc.\n  \n\n  \nNote:\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  6868 Pearl Road\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday- Friday 8:00am-5:00pm\n  \nSaturday- Flexible\/ As needed\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Senior Mortgage Representative","url":"http:\/\/dollarbankcareers.jobs\/4FD6120E2ABF4104846A22C6D971F01124","date_new":"2018-02-07 04:24:20","reqid":"2060BR","country_short":"USA","uid":null,"guid":"4FD6120E2ABF4104846A22C6D971F011","company":"Dollar Bank FSB","location":"Middleburg Heights, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Pittsburgh","description":"DUTIES:\n  \n\n  \n• Process transactions through the teller equipment on all retail and corporate accounts, including, but not limited to, deposits, withdrawals, transfers, loan payments, and cash advances.\n  \n• Issue money orders, cashier checks, gift cards, and savings bonds.\n  \n• Maintains cash flow and security drawers, terminals and other valuables.\n  \n• Maintain a professional appearance and conduct yourself in a professional manner at all times.\n  \n• Process transactions in an accurate and efficient manner while providing quality customer service.\n  \n• Develop a thorough knowledge of Bank products and guidelines by attending the required classes in DBU.\n  \n• Meet established referral goals.\n  \n• Ability to manage a teller window while maintaining an acceptable balancing record and meeting the Bank’s standard of 30 transactions per hour.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \n• High school diploma or GED required.\n  \n• Six months customer service and\/or cash handling experience required. Will also consider related experience such as accounts payable, bookkeeping, or budgeting. Previous teller experience preferred.\n  \n• Must be a team player, flexible and lead by example; must be a highly motivated self-starter.\n  \n• Excellent interpersonal skills and professional manner.\n  \n• Ability to lift a minimum of 3-5 pounds of heavy coin required.\n  \n• Ability to stand on feet for long periods of time required.\n  \n• Professional communication skills and appearance are required.\n  \n• Proficient computer skills and math aptitude required.\n  \n• Must be available to attend scheduled training in the Strip District.\n  \n**Address:**  5822 Forbes Avenue\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  This branch is open Monday - Wednesday and Friday from 9:00 a.m.-4:00 p.m., Thursday from 9:00 a.m. to 6:30 p.m. and on Saturdays from 9:00 a.m.-2:00 p.m.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Full-time Teller Trainee Squirrel Hill","url":"http:\/\/dollarbankcareers.jobs\/AB148470795E430892E089C90CE3597E24","date_new":"2018-01-31 04:22:08","reqid":"2034BR","country_short":"USA","uid":null,"guid":"AB148470795E430892E089C90CE3597E","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Penn Hills","description":"As a Branch Operations Supervisor, you will ensure all activities behind the teller line are completed in accordance with established Dollar Bank operational processes and procedures by training all team members regarding teller functions and communicating changes in operational\/compliance policies. This will be accomplished by offering constructive feedback and positive reinforcement at regular team meetings and through monthly coaching sessions.\n  \n\n  \nQualifications:\n  \n•High School Diploma or GED is required.\n  \n•One year customer service experience in a cash handling environment is required.\n  \n•Leadership or supervisory experience is required.\n  \n•Previous teller experience preferred.\n  \n•Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n•Ability to travel as needed during training.\n  \n•Ability to work a flexible schedule including evenings and Saturdays based on branch hours.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n•Directing and coordinating all transaction activities behind the teller line in accordance with established Dollar Bank operational processes and procedures.\n  \n•Providing quality customer service in a positive, courteous and enthusiastic manner to all internal and external customers.\n  \n•Performing teller functions based upon the needs of the branch. Maintaining an acceptable balancing record while processing transactions in an accurate and efficient manner.\n  \n•Training and developing tellers in the branch to maximize customer relationships through referrals.\n  \n•Demonstrating sound decision making as it relates to balancing risk, profitability and customer service.\n  \n•Maintain professionalism and a positive attitude at all times.\n  \n**Address:**  Penn Hills Shopping Center\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  This branch is open Monday-Friday from 8:30 a.m.-7:00 p.m. and Saturday from 8:30 a.m.-3:00 p.m.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Branch Operations Supervisor","url":"http:\/\/dollarbankcareers.jobs\/15CD934763704ACD9FA63D9E63E044B424","date_new":"2018-01-31 04:22:07","reqid":"2036BR","country_short":"USA","uid":null,"guid":"15CD934763704ACD9FA63D9E63E044B4","company":"Dollar Bank FSB","location":"Penn Hills, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Cleveland","description":"JOB FUNCTION \/ PURPOSE:\n  \n\n  \nWe are seeking a Customer Service Specialist to support our Eastern Cuyahoga and Lake County branches.  This region includes our Painesville, Mentor, Eastlake, Euclid, Richmond Heights, and Mayfield Heights branches. As a Customer Service Specialist, you will be responsible for identifying our customers’ financial needs by providing a thorough analysis and recommending the most appropriate Dollar Bank products and services to fulfill those needs. You will use your customer service experience, product knowledge and positive demeanor to initiate, expand and retain customer relationships through customer conversations and outbound calling. We are looking for flexible, enthusiastic, hardworking individuals with a sincere appreciation for people and an empathetic communication style to proactively contribute to the branch sales and service goals. Candidate will support multiple branch locations in a specified region.\n  \n\n  \nPRINCIPAL ACTIVITIES \/ OBJECTIVES:\n  \nIn a typical banking day you will enjoy a high level of customer contact. The primary focus of this role includes:\n  \n• Providing quality customer service in a positive, courteous and enthusiastic manner to all internal and external customers\n  \n• Contributing to the growth and retention of deposit and loan customers. Demonstrating a proactive sales approach to building customer relationships, effectively utilizing the customer conversations to promote Dollar Bank products and services and meeting the established Relationship Building goals set by your management team.\n  \n• Performing teller functions based upon the needs of the branch. Maintaining an acceptable balancing record while processing transactions in an accurate and efficient manner.\n  \n• Adhering to all established branch operational processes and procedures.\n  \nQUALIFICATIONS:\n  \nThe successful candidate will have the following qualifications:\n  \n\n  \n• High school diploma\/GED required.\n  \n• College degree required, or a minimum of 1 year demonstrated ability to deliver outstanding customer service in financial services or retail industry is required.\n  \n• Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n• Valid driver’s license and access to a reliable vehicle is required.\n  \n• Ability to work a flexible schedule including evenings and Saturdays.\n  \n• Ability to travel as needed to training and\/or multiple branch locations.\n  \n• Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \n\n  \nNOTE:\n  \n\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  1301 East 9th Street\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  Monday - Friday\n  \n8:30 AM - 7:30 PM\n  \n\n  \nSaturday\n  \n8:30 AM - 2:30 PM\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Lake County Float Banker","url":"http:\/\/dollarbankcareers.jobs\/DAB733E15EC8412C9724EDE12927731D24","date_new":"2018-01-24 04:48:20","reqid":"2043BR","country_short":"USA","uid":null,"guid":"DAB733E15EC8412C9724EDE12927731D","company":"Dollar Bank FSB","location":"Cleveland, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Maple Heights","description":"Dollar Bank is currently seeking a Branch Manager for its Maple Heights branch. The Branch Manager is responsible for the overall production of the branch, team development, and efficient daily operation of a full service office.\n  \n\n  \nQualifications:\n  \n\n  \n• Demonstrated ability to deliver outstanding customer service.\n  \n• Proficient computer skills, math aptitude and attention to detail is a must.\n  \n• Demonstrated strong leadership skills and dependability.\n  \n• Effectively communicate and demonstrate strong time management skills as required.\n  \n• Able to work well under pressure and be able to meet deadlines\n  \n• Minimum three years solid management experience in a retail environment is required, including managing a staff, coaching, and meeting goals. Banking environment desirable.\n  \n• Excellent demonstrable time management, communication and motivational skills are necessary.\n  \n• Bachelor’s degree required or commensurate experience.\n  \n• Must be willing to work a flexible schedule, including some evenings and Saturdays.\n  \n• A valid driver’s license and access to a reliable vehicle is required.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n• Consistently provide quality service as outlined in the Bank’s Quality Service Statement.\n  \n• Directly impact the growth and retention of customers through proactive efforts.  This can be accomplished by managing Online RB, ensuring their team is offering customers additional products and services, and holding regular monthly call nights to follow-up on any lists created by the Marketing Department, as well as, other sources of referrals from inside the branch.\n  \n• Focus on building a customer service driven team where everyone contributes to the success of the Relationship Building and Operational efforts.\n  \n• Develop and motivate the team members of their Office by offering constructive feedback and positive reinforcement. This can be accomplished at regular team meetings and through individual documented coaching sessions. Continue the development of the Operation and Relationship Manager’s leadership skills by offering constructive feedback and positive reinforcement through individual documented coaching sessions.\n  \n• Represent Dollar Bank in the community in a professional and competent manner at all times. Is expected to source business deposit and loan relationships within the surrounding communities through active participation in various organizations and charitable functions.\n  \n• Meet the established Group Banking Onsite Visit and Checking Accounts Opened goals each month. This will be accomplished by being proactive in outside calling efforts and by taking advantage all Group Banking opportunities within his market.\n  \n• Exhibit operational knowledge while upholding the operational integrity of the office by assisting the team in all areas of branch operations including Compliance.\n  \n• Achieve all Relationship Building, Operational Integrity, and Customer Service goals.\n  \n• Exercise sound decision-making skills as it relates to balancing risk, profitability, and customer service with every decision.\n  \n• Consistently lead by example, maintain professionalism and a positive attitude at all times and exercise superior leadership skills.\n  \n\n  \nPhysical Requirements and Working Conditions:\n  \nPerform sedentary to light work (able to lift up to 20 pounds from floor to waist, and\/or a negligible amount of force constantly to lift, carry, push, pull, grasp, or otherwise move objects). See, hear, talk and perform tasks requiring manual dexterity and visual acuity; sit, stand, walk, crouch,  reach, pull, push and other similar, repetitive tasks requiring physical activity. Able to operate standard office\/computer equipment such as photocopiers, fax machines, computers, iPads, scanners, calculators, etc.\n  \n**Address:**  5180 Warrensville Center Road\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday through Friday 8:30 am - 7:30 pm\n  \nSaturday 8:30 am - 2:30 pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Branch Manager, Maple","url":"http:\/\/dollarbankcareers.jobs\/33282141C85A4CBB816DCEF04E87C13424","date_new":"2018-01-19 04:33:39","reqid":"2030BR","country_short":"USA","uid":null,"guid":"33282141C85A4CBB816DCEF04E87C134","company":"Dollar Bank FSB","location":"Maple Heights, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Brecksville","description":"Dollar Bank, a solid and progressive financial institution since 1855 continues to expand our business and is currently seeking a Customer Service Specialist for its Brecksville branch.\n  \n\n  \nJOB FUNCTION \/ PURPOSE:\n  \n\n  \nAs a Customer Service Specialist, you will be responsible for identifying our customers’ financial needs by providing a thorough analysis and recommending the most appropriate Dollar Bank products and services to fulfill those needs. You will use your customer service experience, product knowledge and positive demeanor to initiate, expand and retain customer relationships through customer conversations and outbound calling. We are looking for flexible, enthusiastic, hardworking individuals with a sincere appreciation for people and an empathetic communication style to proactively contribute to the branch sales and service goals.\n  \n\n  \nPRINCIPAL ACTIVITIES \/ OBJECTIVES:\n  \n\n  \nIn a typical banking day you will enjoy a high level of customer contact. The primary focus of this role includes:\n  \n•Providing quality customer service in a positive, courteous and enthusiastic manner to all internal and external customers\n  \n•Contributing to the growth and retention of deposit and loan customers. Demonstrating a proactive sales approach to building customer relationships, effectively utilizing the customer conversations to promote Dollar Bank products and services and meeting the established Relationship Building goals set by your management team.\n  \n•Performing teller functions based upon the needs of the branch. Maintaining an acceptable balancing record while processing transactions in an accurate and efficient manner.\n  \n•Adhering to all established branch operational processes and procedures.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \nThe successful candidate will have the following qualifications:\n  \n\n  \n•High school diploma\/GED required.\n  \n•College degree required, or a minimum of 1 year demonstrated ability to deliver outstanding customer service in financial services or retail industry.\n  \n•Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n•Ability to work a flexible schedule including evenings and Saturdays.\n  \n•Ability to travel as needed to training.\n  \n•Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \n**Address:**  7500 Chippewa Road\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  Monday-Thursday: 8:30am - 5:30pm\n  \nFriday: 8:30am - 7:30pm\n  \nSaturday: 8:30 am - 2:30 pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Customer Service Specialist, Brecksville","url":"http:\/\/dollarbankcareers.jobs\/0B39059535E540C89EDE08D73761F11624","date_new":"2018-01-13 04:11:00","reqid":"2008BR","country_short":"USA","uid":null,"guid":"0B39059535E540C89EDE08D73761F116","company":"Dollar Bank FSB","location":"Brecksville, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Pittsburgh","description":"We are seeking a Customer Service Specialist to support our branches in the Pittsburgh and surrounding Pittsburgh area. As a Customer Service Specialist, you will be responsible for identifying our customers’ financial needs by providing a thorough analysis and recommending the most appropriate Dollar Bank products and services to fulfill those needs. You will use your customer service experience, product knowledge and positive demeanor to initiate, expand and retain customer relationships through customer conversations and outbound calling.  We are looking for flexible, enthusiastic, hardworking individuals with a sincere appreciation for people and an empathetic communication style to proactively contribute to the branch sales and service goals. Candidate will support multiple branch locations in a specified region.\n  \n\n  \nPRINCIPAL ACTIVITIES \/ OBJECTIVES:\n  \n\n  \nIn a typical banking day you will enjoy a high level of customer contact.  The primary focus of this role includes:\n  \n• Providing quality customer service in a positive, courteous and enthusiastic manner to all internal and external customers\n  \n• Contributing to the growth and retention of deposit and loan customers. Demonstrating a proactive sales approach to building customer relationships, effectively utilizing the customer conversations to promote Dollar Bank products and services and meeting the established Relationship Building goals set by your management team.\n  \n• Performing teller functions based upon the needs of the branch. Maintaining an acceptable balancing record while processing transactions in an accurate and efficient manner.\n  \n• Adhering to all established branch operational processes and procedures.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \nThe successful candidate will have the following qualifications:\n  \n• High school diploma\/GED required.\n  \n• College degree required, or a minimum of 1 year demonstrated ability to deliver outstanding customer service in financial services or retail industry is required.\n  \n• Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n• Valid driver’s license and access to a reliable vehicle is required.\n  \n• Ability to work a flexible schedule including evenings and Saturdays.\n  \n• Ability to travel as needed to training and\/or multiple branch locations.\n  \n• Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \n**Address:**  Three Gateway Center\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  This position will travel to our branches located in the South and West Regions of Pittsburgh. This will include branches with evening and weekend hours.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits.aspx .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Customer Service Specialist - South\/West Region","url":"http:\/\/dollarbankcareers.jobs\/F611D5262296404DAD19A7DD17DA1A6124","date_new":"2017-12-08 04:41:16","reqid":"1893BR","country_short":"USA","uid":null,"guid":"F611D5262296404DAD19A7DD17DA1A61","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Virginia Beach","description":"Loan representative will develop relationships with current and prospective customers with the goal of generating opportunities to promote the Bank’s products and services in the workplace and obtain new customer relationships. Loan Center Representative will be responsible for generating new consumer loans and its associated products and services through various proactive efforts.\n  \n\n  \nQualifications:\n  \n•A minimum of 1 year of related sales experience required with a proven track record of achieving desired results required.\n  \n•High School Diploma\/GED required. Will consider commensurate experience.\n  \n•Demonstrated ability and desire to consistently deliver quality service and build customer relationships.\n  \n•Excellent written and verbal communication skills and ability to conduct formal presentations.\n  \n•Demonstrated proactive techniques, creativity, resourcefulness, and self-motivation in producing results.\n  \n•Working knowledge of Microsoft Word and Excel.\n  \n•Demonstrated ability to manage and perform multiple tasks while delivering professional results.\n  \n•Access to reliable transportation required.\n  \n\n  \nPrinciple Activities and Duties:\n  \n•Personally provide quality customer service to all internal and external customers.\n  \n•Achieve all goals by consistently implementing effective relationship building techniques taught in training and consistent with the Bank’s service philosophy and business standards.\n  \n•Consistently generate new loan production and the associated products and services through proactive efforts including: utilization of effective outbound calling efforts, networking and community events, soliciting current customers within the branch (in-branch only), handling CHAT inquiries and through participation in trade shows.\n  \n•Identify businesses and key business owners within the community that may lead to new Preferred Referral Sources (Vendors).\n  \n•Attend a minimum of one networking activity each month that helps to generate new asset or referral opportunities.\n  \n•Adhere to all operational processes and procedures that have been put in place within the loan center assigned.\n  \n•Comply with all Federal and State Banking regulations that apply.\n  \n**Address:**  501 S. Independence Blvd\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Rotating schedule\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement. Part-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement. For more information, please visit http:\/\/www.dollar.bank\/company\/careers\/benefits.\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \nMinority\/Female\/Veteran\/Disabled","title":"LOAN REP (Loan Center)","url":"http:\/\/dollarbankcareers.jobs\/23D9F5031E32450EB70A05D9D7C1B34524","date_new":"2017-11-21 04:50:07","reqid":"1961BR","country_short":"USA","uid":null,"guid":"23D9F5031E32450EB70A05D9D7C1B345","company":"Dollar Bank FSB","location":"Virginia Beach, VA","state":"Virginia","state_short":"VA"},{"country":"United States","city":"Pittsburgh","description":"JOB FUNCTION \/ PURPOSE:\n  \n\n  \nAs a Customer Service Specialist, you will be responsible for identifying our customers’ financial needs by providing a thorough analysis and recommending the most appropriate Dollar Bank products and services to fulfill those needs. You will use your customer service experience, product knowledge and positive demeanor to initiate, expand and retain customer relationships through customer conversations and outbound calling.  We are looking for flexible, enthusiastic, hardworking individuals with a sincere appreciation for people and an empathetic communication style to proactively contribute to the branch sales and service goals.\n  \n\n  \nPRINCIPAL ACTIVITIES \/ OBJECTIVES:\n  \n\n  \nIn a typical banking day you will enjoy a high level of customer contact.  The primary focus of this role includes:\n  \n• Providing quality customer service in a positive, courteous and enthusiastic manner to all internal and external customers\n  \n• Contributing to the growth and retention of deposit and loan customers. Demonstrating a proactive sales approach to building customer relationships, effectively utilizing the customer conversations to promote Dollar Bank products and services and meeting the established Relationship Building goals set by your management team.\n  \n• Performing teller functions based upon the needs of the branch. Maintaining an acceptable balancing record while processing transactions in an accurate and efficient manner.\n  \n• Adhering to all established branch operational processes and procedures.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \nThe successful candidate will have the following qualifications:\n  \n• High school diploma\/GED required.\n  \n• College degree required, or a minimum of 1 year demonstrated ability to deliver outstanding customer service in financial services or retail industry.\n  \n• Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n• Ability to work a flexible schedule including evenings and Saturdays.\n  \n• Ability to travel as needed to training.\n  \n• Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \n**Address:**  6460 Steubenville Pike\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  The branch is open Monday through Thursday 9:00 a.m. to 5:00 p.m., Friday 9:00 a.m. to 7:00 p.m. and Saturday 8:30 a.m. to 2:00 p.m.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit  http:\/\/www.dollar.bank\/company\/careers\/benefits .\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Customer Service Specialist","url":"http:\/\/dollarbankcareers.jobs\/945EC67929B94B62840BC6EDDF83AF6824","date_new":"2017-10-27 04:05:04","reqid":"1925BR","country_short":"USA","uid":null,"guid":"945EC67929B94B62840BC6EDDF83AF68","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"},{"country":"United States","city":"Cleveland","description":"Job Overview:\n  \n\n  \nThe Vice President of Lending establishes and manages a portfolio of high net worth clients to include various types of loans and deposits. The individual will develop and manage all aspects of the relationship. The individual will also coordinate and assess financial scenarios and act as a referral source to other asset areas of Dollar Bank. The Vice President will work with Financial Planners, Brokers, CPA’s, and Attorneys, with the objective of providing optimal solutions for the client. The individual also properly collects information and monitors credit of the client. The Private Banking Department offers its high net worth customers a broad array of services, each tailored to an individual client’s needs. These services include, but are not limited to, a variety of credit products such as commercial loans, mortgage loans and home equity loans as well as selection of deposit products such as Checking and Savings accounts, CDs, IRA as well as Money Market Accounts\n  \n\n  \nQualifications:\n  \n\n  \n•Bachelor’s Degree in Finance or related field required. Will consider commensurate experience. MBA preferred.\n  \n•Minimum of 5 years of lending experience in Private Banking or commercial lending experience required.\n  \n•Previous supervisory experience.\n  \n•Solid credit\/ underwriting skills required.\n  \n•Solid understanding of legal and regulatory issues associated with the lending function, as well as documentation requirements is also needed.\n  \n•Must possess strong analytical, organizational, and customer service skills.\n  \n•Exceptional oral and written communication skills required.\n  \n•Proficiency in computer skills including Microsoft Work & Excel required.\n  \n•Solid understanding of collateral, valuation, perfections and liquidation is preferred.\n  \n•Must have excellent interpersonal skills and the ability to be a team leader as well as a team player in a professional team setting.\n  \n\n  \nPrinciple Activities and Duties:\n  \n\n  \n•Source and develop new client relationships to include loans and deposits.\n  \n•Gather financial information and underwrite loan reports.\n  \n•Put in proposal format and present to Division Head and Credit Committees for approval.\n  \n•Administer and maintain loan portfolio.\n  \n•Meet a minimum of $10 million annual loan production plus associated deposit accounts to develop solid and consistent relationships with the clients.\n  \n•Maintain high credit standards to ensure that the highest levels of the portfolio quality are achieved.\n  \n•Ensure that proper and complete loan documentation is prepared and executed, and that security conformity with loan covenants, collateral advance ratios and other conditions.\n  \n•As necessary, manage workouts, ensuring maximum preservation of principal for the Bank.\n  \n•Further develop and refer business to other asset areas of Dollar Bank to include, but not limit to: Corporate Banking, Treasury Management, Business Banking and Commercial Real Estate.\n  \n•Participate in professional associations and community activities to increase Dollar Bank’s visibility and enhance new business opportunities.\n  \n\n  \nPhysical Requirements and Working Conditions:\n  \nPerform sedentary to light work (able to lift up to 20 pounds from floor to waist, and\/or a negligible amount of force constantly to lift, carry, push, pull, grasp, or otherwise move objects). See, hear, talk and perform tasks requiring manual dexterity and visual acuity; sit, stand, walk, crouch, reach, pull, push and other similar, repetitive tasks requiring physical activity. Able to operate standard office\/computer equipment such as photocopiers, fax machines, computers, iPads, scanners, calculators, etc.\n  \n\n  \nNote:\n  \nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n  \n**Address:**  Tower at Erieview\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Exempt\n  \n**Schedule Information:**  Monday-Friday, 8:30 am - 5:30 pm\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit http:\/\/www.dollar.bank\/company\/careers\/benefits.\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \nMinority\/Female\/Veteran\/Disabled","title":"Vice President, Lending Private Banking","url":"http:\/\/dollarbankcareers.jobs\/B046B377AA0C447DAB93FDCE9A64A23624","date_new":"2017-09-09 04:52:22","reqid":"1883BR","country_short":"USA","uid":null,"guid":"B046B377AA0C447DAB93FDCE9A64A236","company":"Dollar Bank FSB","location":"Cleveland, OH","state":"Ohio","state_short":"OH"},{"country":"United States","city":"Pittsburgh","description":"We are seeking a Customer Service Specialist to support our branches in the Pittsburgh and surrounding Pittsburgh area. As a Customer Service Specialist, you will be responsible for identifying our customers’ financial needs by providing a thorough analysis and recommending the most appropriate Dollar Bank products and services to fulfill those needs. You will use your customer service experience, product knowledge and positive demeanor to initiate, expand and retain customer relationships through customer conversations and outbound calling.  We are looking for flexible, enthusiastic, hardworking individuals with a sincere appreciation for people and an empathetic communication style to proactively contribute to the branch sales and service goals. Candidate will support multiple branch locations in a specified region.\n  \n\n  \nPRINCIPAL ACTIVITIES \/ OBJECTIVES:\n  \n\n  \nIn a typical banking day you will enjoy a high level of customer contact.  The primary focus of this role includes:\n  \n• Providing quality customer service in a positive, courteous and enthusiastic manner to all internal and external customers\n  \n• Contributing to the growth and retention of deposit and loan customers. Demonstrating a proactive sales approach to building customer relationships, effectively utilizing the customer conversations to promote Dollar Bank products and services and meeting the established Relationship Building goals set by your management team.\n  \n• Performing teller functions based upon the needs of the branch. Maintaining an acceptable balancing record while processing transactions in an accurate and efficient manner.\n  \n• Adhering to all established branch operational processes and procedures.\n  \n\n  \nQUALIFICATIONS:\n  \n\n  \nThe successful candidate will have the following qualifications:\n  \n• High school diploma\/GED required.\n  \n• College degree required, or a minimum of 1 year demonstrated ability to deliver outstanding customer service in financial services or retail industry is required.\n  \n• Must have excellent written and verbal communication skills to include professional grammar and demeanor.\n  \n• Valid driver’s license and access to a reliable vehicle is required.\n  \n• Ability to work a flexible schedule including evenings and Saturdays.\n  \n• Ability to travel as needed to training and\/or multiple branch locations.\n  \n• Successful candidate must meet and comply with all requirements set forth in the SAFE Act, including, but not limited to successful completion of the required background checks, and obtaining a unique identifier by the NMLS.\n  \n**Address:**  Three Gateway Center\n  \n**Employment Status:**  Full-time\n  \n**FLSA:**  Non-Exempt\n  \n**Schedule Information:**  This position will travel to our branches located in the North Region of Pittsburgh. This will include branches with evening and weekend hours.\n  \n**Benefits Information:**  Full-time employees are eligible for a comprehensive benefits package including medical, dental, vision, 401(k) with immediate vesting, tuition reimbursement, and gym membership reimbursement.\n  \n\n  \nPart-time employees qualify for 401(k) with immediate vesting, tuition reimbursement, and gym reimbursement.\n  \n\n  \nFor more information, please visit\n  \nhttp:\/\/www.dollarbank.com\/careers\/training_and_benefits.aspx .\n  \n\n  \n**EEO Statement:**  Dollar Bank is an Equal Opportunity Employer.\n  \n\n  \nMinority\/Female\/Veteran\/Disabled","title":"Personal Banker - North Region","url":"http:\/\/dollarbankcareers.jobs\/A03F086C7B194C89ABBE76CD0ED3319324","date_new":"2017-07-19 04:29:07","reqid":"1772BR","country_short":"USA","uid":null,"guid":"A03F086C7B194C89ABBE76CD0ED33193","company":"Dollar Bank FSB","location":"Pittsburgh, PA","state":"Pennsylvania","state_short":"PA"}]